[
    "Once when I was six years old I saw a magnificent picture in a book, called True Stories from \nNature, about the primeval forest.\n",
    "It was a picture of a boa constrictor in the act of swallowing an \nanimal.\nHere is a copy of the drawing.\n",
    "\nIn the book it said: “Boa constrictors swallow their prey whole, without chewing it.\nAfter that they \n",
    "are not able to move, and they sleep through the six months that they need for digestion.” I \npondered deeply, then, over the adventures of the jungle.\n",
    "And after some work with a coloured \npencil I succeeded in making my first drawing.\nMy Drawing Number One.\n",
    "It looked like this: \n\n\nI showed my masterpiece to the grown-ups, and asked them whether the drawing frightened them.\n",
    "But they answered: “Frighten?\nWhy should any one be frightened by a hat?” My drawing was not \na picture of a hat.\n",
    "It was a picture of a boa constrictor digesting an elephant.\nBut since the grown- \nups were not able to understand it, I made another drawing: I drew the inside of the boa \n",
    "constrictor, so that the grown-ups could see it clearly.\nThey always need to have things explained.\n",
    "\n\nMy Drawing Number Two looked like this: \n\n\nThe grown-ups’ response, this time, was to advise me to lay aside my drawings of boa \n",
    "constrictors, whether from the inside or the outside, and devote myself instead to geography, \nhistory, arithmetic and grammar.\n",
    "That is why, at the age of six, I gave up what might have been a \nmagnificent career as a painter.\nI had been disheartened by the failure of my Drawing Number \n",
    "One and my Drawing Number Two.\nGrown-ups never understand anything by themselves, and it is \ntiresome for children to be always and forever explaining things to them.\n",
    "\nSo then I chose another profession, and learned to pilot air-planes.\nI have flown a little over all \n",
    "parts of the world; and it is true that geography has been very useful to me.\nAt a glance I can \ndistinguish China from Arizona.\n",
    "If one gets lost in the night, such knowledge is valuable.\nIn the \ncourse of this life I have had a great many encounters with a great many people who have been \n",
    "concerned with matters of consequence.\nI have lived a great deal among grown-ups.\nI have seen \nthem intimately, close at hand.\n",
    "And that hasn’t much improved my opinion of them.\n\nWhenever I met one of them who seemed to me at all clear-sighted, I tried the experiment of \n",
    "showing him my Drawing Number One, which I have always kept.\nI would try to find out, so, if this \nwas a person of true understanding.\n",
    "But, whoever it was, he, or she, would always say: “That is a \nhat.” Then I would never talk to that person about boa constrictors, or primeval forests, or stars.\n",
    "I \nwould bring myself down to his level.\nI would talk to him about bridge, and golf, and politics, and \n",
    "neckties.\nAnd the grown-up would be greatly pleased to have met such a sensible man.\n\nSo I lived my life alone, without anyone that I could really talk to, until I had an accident with my \n",
    "plane in the Desert of Sahara, six years ago.\nSomething was broken in my engine.\nAnd as I had \nwith me neither a mechanic nor any passengers, I set myself to attempt the difficult repairs all \n",
    "alone.\nIt was a question of life or death for me: I had scarcely enough drinking water to last a \nweek.\n",
    "\nThe first night, then, I went to sleep on the sand, a thousand miles from any human habitation.\nI \n",
    "was more isolated than a shipwrecked sailor on a raft in the middle of the ocean.\nThus you can \nimagine my amazement, at sunrise, when I was awakened by an odd little voice.\n",
    "\n\nIt said: “If you please, draw me a sheep!” \n“What!” \n“Draw me a sheep!” \nI jumped to my feet, completely thunderstruck.\n",
    "I blinked my eyes hard.\nI looked carefully all \naround me.\nAnd I saw a most extraordinary small person, who stood there examining me with \n",
    "great seriousness.\nHere you may see the best portrait that, later, I was able to make of him.\nBut \nmy drawing is certainly very much less charming than its model.\n",
    "\nThat, however, is not my fault.\nThe grown-ups discouraged me in my painter’s career when I was \nsix years old, and I never learned to draw anything, except boas from the outside and boas from \n",
    "the inside.\n\nNow I stared at this sudden apparition with my eyes fairly starting out of my head in \n",
    "astonishment.\nRemember, I had crashed in the desert a thousand miles from any inhabited region.\nAnd yet my little man seemed neither to be straying uncertainly among the sands, nor to be \n",
    "fainting from fatigue or hunger or thirst or fear.\nNothing about him gave any suggestion of a child \n",
    "lost in the middle of the desert, a thousand miles from any human habitation.\n\nWhen at last I was able to speak, I said to him: “But, what are you doing here?” And in answer he \n",
    "repeated, very slowly, as if he were speaking of a matter of great consequence: \n“If you please, draw me a sheep…” \n",
    "When a mystery is too overpowering, one dare not disobey.\nAbsurd as it might seem to me, a \nthousand miles from any human habitation and in danger of death, I took out of my pocket a sheet \n",
    "of paper and my fountain pen.\nBut then I remembered how my studies had been concentrated on \ngeography, history, arithmetic, and grammar, and I told the little chap (a little crossly, too) that I \n",
    "did not know how to draw.\nHe answered me: “That doesn’t matter.\nDraw me a sheep…” \n\n\nBut I had never drawn a sheep.\n",
    "So I drew for him one of the two pictures I had drawn so often.\nIt \nwas that of the boa constrictor from the outside.\n",
    "And I was astounded to hear the little fellow \ngreet it with, “No, no, no!\nI do not want an elephant inside a boa constrictor.\n",
    "A boa constrictor is a \nvery dangerous creature, and an elephant is very cumbersome.\nWhere I live, everything is very \n",
    "small.\nWhat I need is a sheep.\nDraw me a sheep.\n\n\nSo then I made a drawing.\nHe looked at it carefully, then he said: “No.\n",
    "This sheep is already very \nsickly.\nMake me another.” So I made another drawing.\nMy friend smiled gently and indulgently.\n",
    "“You see yourself,” he said, “that this is not a sheep.\nThis is a ram.\nIt has horns.\n\n\nSo then I did my drawing over once more.\n",
    "But it was rejected too, just like the others.\n“This one is \ntoo old.\nI want a sheep that will live a long time.\n",
    "\nBy this time my patience was exhausted, because I was in a hurry to start taking my engine apart.\nSo I tossed off this drawing.\n",
    "And I threw out an explanation with it.\n\n“This is only his box.\nThe sheep you asked for is inside.” \n",
    "\n\nI was very surprised to see a light break over the face of my young judge: \n“That is exactly the way I wanted it!\n",
    "Do you think that this sheep will have to have a great deal of \ngrass?” \n“Why?” \n“Because where I live everything is very small…” \n",
    "“There will surely be enough grass for him,” I said.\n\n“It is a very small sheep that I have given you.” \n",
    "He bent his head over the drawing: “Not so small that, Look!\nHe has gone to sleep…” \nAnd that is how I made the acquaintance of the little prince.\n",
    "\nIt took me a long time to learn where he came from.\nThe little prince, who asked me so many \nquestions, never seemed to hear the ones I asked him.\n",
    "It was from words dropped by chance that, \nlittle by little, everything was revealed to me.\n\nThe first time he saw my air-plane, for instance (I shall not draw my air-plane; that would be much \n",
    "too complicated for me), he asked me: “What is that object?” \n“That is not an object.\nIt flies.\nIt is an air-plane.\n",
    "It is my air-plane.” And I was proud to have him \nlearn that I could fly.\nHe cried out, then: “What!\n",
    "You dropped down from the sky?” \n\n“Yes,” I answered, modestly.\n\n\n“Oh!\nThat is funny!” And the little prince broke into a lovely peal of laughter, which irritated me \n",
    "very much.\nI like my misfortunes to be taken seriously.\n\nThen he added: “So you, too, come from the sky!\n",
    "Which is your planet?” At that moment I caught \na gleam of light in the impenetrable mystery of his presence; and I demanded, abruptly: “Do you \n",
    "come from another planet?” But he did not reply.\nHe tossed his head gently, without taking his \neyes from my plane: “It is true that on that you can’t have come from very far away…” And he \n",
    "sank into a reverie, which lasted a long time.\nThen, taking my sheep out of his pocket, he buried \nhimself in the contemplation of his treasure.\n",
    "\nYou can imagine how my curiosity was aroused by this half-confidence about the “other planets.” I \n",
    "made a great effort, therefore, to find out more on this subject.\n\n“My little man, where do you come from?\n",
    "What is this ‘where I live,’ of which you speak?\nWhere \ndo you want to take your sheep?” \nAfter a reflective silence he answered: “The thing that is so good about the box you have given \n",
    "me is that at night he can use it as his house.” \n“That is so.\nAnd if you are good I will give you a string, too, so that you can tie him during the day, \n",
    "and a post to tie him to.” \nBut the little prince seemed shocked by this offer: “Tie him!\nWhat a queer idea!” \n",
    "“But if you don’t tie him,” I said, “he will wander off somewhere, and get lost.” \nMy friend broke into another peal of laughter: “But where do you think he would go?” \n",
    "“Anywhere.\nStraight ahead of him.” \nThen the little prince said, earnestly: “That doesn’t matter.\nWhere I live, everything is so small!” \n",
    "And, with perhaps a hint of sadness, he added: “Straight ahead of him, nobody can go very far…” \n\n\nI had thus learned a second fact of great importance: this was that the planet the little prince \n",
    "came from was scarcely any larger than a house!\nBut that did not really surprise me much.\nI knew \nvery well that in addition to the great planets, such as the Earth, Jupiter, Mars, Venus, to which \n",
    "we have given names, there are also hundreds of others, some of which are so small that one has \na hard time seeing them through the telescope.\n",
    "\n\nWhen an astronomer discovers one of these he does not give it a name, but only a number.\nHe \nmight call it, for example, “Asteroid 325.” \n",
    "\n\nI have serious reason to believe that the planet from which the little prince came is the asteroid \n",
    "known as B-612.\nThis asteroid has only once been seen through the telescope.\nThat was by a \nTurkish astronomer, in 1909.\n",
    "\nOn making his discovery, the astronomer had presented it to the International Astronomical \nCongress, in a great demonstration.\n",
    "But he was in Turkish costume, and so nobody would believe \nwhat he said.\nGrown-ups are like that… \n",
    "Fortunately, however, for the reputation of Asteroid B-612, a Turkish dictator made a law that his \n",
    "subjects, under pain of death, should change to European costume.\nSo in 1920 the astronomer \ngave his demonstration all over again, dressed with impressive style and elegance.\n",
    "And this time \neverybody accepted his report.\n\nIf I have told you these details about the asteroid, and made a note of its number for you, it is on \n",
    "account of the grown-ups and their ways.\nWhen you tell them that you have made a new friend, \nthey never ask you any questions about essential matters.\n",
    "They never say to you, “What does his \nvoice sound like?\nWhat games does he love best?\nDoes he collect butterflies?” Instead, they \n",
    "demand: “How old is he?\nHow many brothers has he?\nHow much does he weigh?\nHow much \nmoney does his father make?” \n",
    "Only from these figures do they think they have learned anything about him.\n\nIf you were to say to the grown-ups: “I saw a beautiful house made of rosy brick, with geraniums \n",
    "in the windows and doves on the roof,” they would not be able to get any idea of that house at all.\n",
    "\nYou would have to say to them: “I saw a house that cost $ 20,000.” Then they would exclaim: “Oh, \nwhat a pretty house that is!” Just so, you might say to them: “The proof that the little prince \n",
    "existed is that he was charming, that he laughed, and that he was looking for a sheep.\nIf anybody \nwants a sheep, that is a proof that he exists.” And what good would it do to tell them that?\n",
    "They \nwould shrug their shoulders, and treat you like a child.\nBut if you said to them: “The planet he \n",
    "came from is Asteroid B-612,” then they would be convinced, and leave you in peace from their \nquestions.\n",
    "They are like that.\nOne must not hold it against them.\nChildren should always show \ngreat forbearance toward grown-up people.\n",
    "But certainly, for us who understand life, figures are a \nmatter of indifference.\n\nI should have liked to begin this story in the fashion of the fairy-tales.\n",
    "I should have like to say: \n“Once upon a time there was a little prince who lived on a planet that was scarcely any bigger \n",
    "\nthan himself, and who had need of a sheep…” \n\nTo those who understand life, that would have given a much greater air of truth to my story.\n",
    "Fori \ndo not want any one to read my book carelessly.\nI have suffered too much grief in setting down \n",
    "these memories.\nSix years have already passed since my friend went away from me, with his \nsheep.\nIf I try to describe him here, it is to make sure that I shall not forget him.\n",
    "To forget a friend \nis sad.\nNot every one has had a friend.\nAnd if I forget him, I may become like the grown-ups who \n",
    "are no longer interested in anything but figures… It is for that purpose, again, that I have bought a \n",
    "box of paints and some pencils.\n\nIt is hard to take up drawing again at my age, when I have never made any pictures except those \n",
    "of the boa constrictor from the outside and the boa constrictor from the inside, since I was six.\nI \n",
    "shall certainly try to make my portraits as true to life as possible.\nBut I am not at all sure of \nsuccess.\n",
    "One drawing goes along all right, and another has no resemblance to its subject.\nI make \nsome errors, too, in the little prince’s height: in one place he is too tall and in another too short.\n",
    "And I feel some doubts about the colour of his costume.\nSo I fumble along as best I can, now good, \n",
    "now bad, and I hope generally fair-to- middling.\nIn certain more important details I shall make \nmistakes, also.\n",
    "But that is something that will not be my fault.\nMy friend never explained anything \nto me.\nHe thought, perhaps, that I was like himself.\n",
    "But I, alas, do not know how to see sheep \nthrough the walls of boxes.\nPerhaps I am a little like the grown-ups.\n",
    "I have had to grow old.\n\nAs each day passed I would learn, in our talk, something about the little prince’s planet, his \n",
    "departure from it, his journey.\nThe information would come very slowly, as it might chance to fall \n",
    "from his thoughts.\nIt was in this way that I heard, on the third day, about the catastrophe of the \n",
    "baobabs.\n\nThis time, once more, I had the sheep to thank for it.\nFor the little prince asked me abruptly, as if \n",
    "seized by a grave doubt, \n“It is true, isn’t it, that sheep eat little bushes?” \n“Yes, that is true.” \n",
    "“Ah!\nI am glad!” \nI did not understand why it was so important that sheep should eat little bushes.\n",
    "But the little \nprince added: “Then it follows that they also eat baobabs?” I pointed out to the little prince that \n",
    "baobabs were not little bushes, but, on the contrary, trees as big as castles; and that even if he \n",
    "took a whole herd of elephants away with him, the herd would not eat up one single baobab.\n\nThe idea of the herd of elephants made the little prince laugh.\n",
    "“We would have to put them one on \ntop of the other,” he said.\nBut he made a wise comment: \n“Before they grow so big, the baobabs start out by being little.” \n",
    "“That is strictly correct,” I said.\n“But why do you want the sheep to eat the little baobabs?” \nHe answered me at once, “Oh, come, come!”, as if he were speaking of something that was self- \n",
    "evident.\nAnd I was obliged to make a great mental effort to solve this problem, without any \nassistance.\n",
    "\nIndeed, as I learned, there were on the planet where the little prince lived, as on all planets, good \n",
    "\n\nplants and bad plants.\nIn consequence, there were good seeds from good plants, and bad seeds \nfrom bad plants.\n",
    "But seeds are invisible.\nThey sleep deep in the heart of the earth’s darkness, \nuntil some one among them is seized with the desire to awaken.\n",
    "Then this little seed will stretch \nitself and begin, timidly at first, to push a charming little sprig inoffensively upward toward the \n",
    "sun.\nIf it is only a sprout of radish or the sprig of a rose-bush, one would let it grow wherever it \n",
    "might wish.\nBut when it is a bad plant, one must destroy it as soon as possible, the very first \ninstant that one recognises it.\n",
    "\nNow there were some terrible seeds on the planet that was the home of the little prince; and these \n",
    "were the seeds of the baobab.\nThe soil of that planet was infested with them.\nA baobab is \nsomething you will never, never be able to get rid of if you attend to it too late.\n",
    "It spreads over the \nentire planet.\nIt bores clear through it with its roots.\nAnd if the planet is too small, and the \n",
    "baobabs are too many, they split it in pieces… \n“It is a question of discipline,” the little prince said to me later on.\n",
    "\n“When you’ve finished your own toilet in the morning, then it is time to attend to the toilet of your \n",
    "planet, just so, with the greatest care.\nYou must see to it that you pull up regularly all the baobabs, \n",
    "at the very first moment when they can be distinguished from the rosebushes, which they \nresemble so closely in their earliest youth.\n",
    "It is very tedious work,” the little prince added, “but \nvery easy.” And one day he said to me: “You ought to make a beautiful drawing, so that the \n",
    "children where you live can see exactly how all this is.\nThat would be very useful to them if they \n",
    "were to travel some day.\n\n\nSometimes,” he added, “there is no harm in putting off a piece of work until another day.\n",
    "But \nwhen it is a matter of baobabs, that always means a catastrophe.\n\nI knew a planet that was inhabited by a lazy man.\n",
    "He neglected three little bushes… So, as the \nlittle prince described it to me, I have made a drawing of that planet.\n",
    "I do not much like to take \nthe tone of a moralist.\nBut the danger of the baobabs is so little understood, and such considerable \n",
    "risks would be run by anyone who might get lost on an asteroid, that for once I am breaking \nthrough my reserve.\n",
    "“Children,” I say plainly, “watch out for the baobabs!” My friends, like \nmyself, have been skirting this danger for a long time, without ever knowing it; and so it is for \n",
    "them that I have worked so hard over this drawing.\n\nThe lesson which I pass on by this means is worth all the trouble it has cost me.\n",
    "Perhaps you will \nask me, “Why are there no other drawing in this book as magnificent and impressive as this \n",
    "drawing of the baobabs?” The reply is simple.\nI have tried.\nBut with the others I have not been \nsuccessful.\n",
    "When I made the drawing of the baobabs I was carried beyond myself by the inspiring \nforce of urgent necessity.\n",
    "\nOh, little prince!\nBit by bit I came to understand the secrets of your sad little life… For a long time \n",
    "you had found your only entertainment in the quiet pleasure of looking at the sunset.\n\nI learned that new detail on the morning of the fourth day, when you said to me: \n",
    "“I am very fond of sunsets.\nCome, let us go look at a sunset now.” \n“But we must wait,” I said.\n\n“Wait?\n",
    "For what?” \n“For the sunset.\nWe must wait until it is time.” \nAt first you seemed to be very much surprised.\n",
    "And then you laughed to yourself.\nYou said to me: \n“I am always thinking that I am at home!” \nJust so.\n",
    "Everybody knows that when it is noon in the United States the sun is setting over France.\nIf you could fly to France in one minute, you could go straight into the sunset, right from noon.\n",
    "Unfortunately, France is too far away for that.\nBut on your tiny planet, my little prince, all you \n",
    "need do is move your chair a few steps.\nYou can see the day end and the twilight falling whenever \nyou like… \n",
    "“One day,” you said to me, “I saw the sunset forty-four times!” \nAnd a little later you added: “You know, one loves the sunset, when one is so sad…” “Were you so \n",
    "sad, then?” I asked, “on the day of the forty-four sunsets?” \nBut the little prince made no reply.\n\n",
    "On the fifth day, again, as always, it was thanks to the sheep, the secret of the little prince’s life \n",
    "was revealed to me.\n\nAbruptly, without anything to lead up to it, and as if the question had been born of long and silent \n",
    "meditation on his problem, he demanded: “A sheep; if it eats little bushes, does it eat flowers, \ntoo?” \n",
    "\n\n“A sheep,” I answered, “eats anything it finds in its reach.” \n\n“Even flowers that have thorns?” \n",
    "“Yes, even flowers that have thorns.” \n“Then the thorns, what use are they?” I did not know.\n\nAt that moment I was very busy trying to unscrew a bolt that had got stuck in my engine.\n",
    "I was \nvery much worried, for it was becoming clear to me that the breakdown of my plane was \nextremely serious.\n",
    "And I had so little drinking water left that I had to fear for the worst.\n\n“The thorns, what use are they?” \n",
    "The little prince never let go of a question, once he had asked it.\nAs for me, I was upset over that \n",
    "bolt.\nAnd I answered with the first thing that came into my head: “The thorns are of no use at all.\n",
    "Flowers have thorns just for spite!” \n“Oh!” There was a moment of complete silence.\n\nThen the little prince flashed back at me, with a kind of resentfulness: “I don’t believe you!\n",
    "Flowers are weak creatures.\nThey are naive.\nThey reassure themselves as best they can.\nThey \nbelieve that their thorns are terrible weapons…” \n",
    "I did not answer.\nAt that instant I was saying to myself: “If this bolt still won’t turn, I am going to \n",
    "knock it out with the hammer.” \nAgain the little prince disturbed my thoughts.\n“And you actually believe that the flowers…” \n",
    "“Oh, no!” I cried.\n“No, no no!\nI don’t believe anything.\nI answered you with the first thing that \ncame into my head.\n",
    "Don’t you see, I am very busy with matters of consequence!” \nHe stared at me, thunderstruck.\n“Matters of consequence!” \n",
    "He looked at me there, with my hammer in my hand, my fingers black with engine grease, bending \ndown over an object which seemed to him extremely ugly… \n",
    "“You talk just like the grown-ups!” That made me a little ashamed.\nBut he went on, relentlessly: \n“You mix everything up together… You confuse everything…” \n",
    "He was really very angry.\nHe tossed his golden curls in the breeze.\n\n“I know a planet where there is a certain red-faced gentleman.\n",
    "He has never smelled a flower.\nHe \nhas never looked at a star.\nHe has never loved any one.\nHe has never done anything in his life but \n",
    "add up figures.\nAnd all day he says over and over, just like you: ‘I am busy with matters of \nconsequence!’ And that makes him swell up with pride.\n",
    "\n“But he is not a man, he is a mushroom!” \n\n“A what?” \n\n“A mushroom!” The little prince was now white with rage.\n",
    "“The flowers have been growing thorns \nfor millions of years.\nFor millions of years the sheep have been eating them just the same.\n",
    "And is \nit not a matter of consequence to try to understand why the flowers go to so much trouble to grow \n",
    "\n\n' ' \nI \\ \n\n\nthorns, which are never of any use to them?\nIs the warfare between the sheep and the flowers not \n",
    "important?\nIs this not of more consequence than a fat red-faced gentleman’s sums?\nAnd if I know, \nI, myself, one flower which is unique in the world, which grows nowhere but on my planet, but \n",
    "which one little sheep can destroy in a single bite some morning, without even noticing what he is \n",
    "doing, Oh!\nYou think that is not important!\nHis face turned from white to red as he continued: “If \n",
    "some one loves a flower, of which just one single blossom grows in all the millions and millions of \n",
    "stars, it is enough to make him happy just to look at the stars.\n\nHe can say to himself, ‘Somewhere, my flower is there…’ But if the sheep eats the flower, in one \n",
    "moment all his stars will be darkened… And you think that is not important!” \nHe could not say anything more.\n",
    "His words were choked by sobbing.\nThe night had fallen.\nI had \nlet my tools drop from my hands.\nOf what moment now was my hammer, my bolt, or thirst, or \n",
    "death?\nOn one star, one planet, my planet, the Earth, there was a little prince to be comforted.\nI \n",
    "took him in my arms, and rocked him.\nI said to him: “The flower that you love is not in danger.\nI \nwill draw you a muzzle for your sheep.\n",
    "I will draw you a railing to put around your flower.\nI will…” \nI did not know what to say to him.\nI felt awkward and blundering.\n",
    "I did not know how I could reach \nhim, where I could overtake him and go on hand in hand with him once more.\n",
    "\nIt is such a secret place, the land of tears.\n\nI soon learned to know this flower better.\nOn the little prince’s planet the flowers had always been \n",
    "very simple.\nThey had only one ring of petals; they took up no room at all; they were a trouble to \n",
    "nobody.\nOne morning they would appear in the grass, and by night they would have faded \npeacefully away.\n",
    "But one day, from a seed blown from no one knew where, a new flower had come \nup; and the little prince had watched very closely over this small sprout which was not like any \n",
    "other small sprouts on his planet.\n\nIt might, you see, have been a new kind of baobab.\nThe shrub soon stopped growing, and began to \n",
    "get ready to produce a flower.\nThe little prince, who was present at the first appearance of a huge \n",
    "bud, felt at once that some sort of miraculous apparition must emerge from it.\nBut the flower was \nnot satisfied to complete the preparations for her beauty in the shelter of her green chamber.\n",
    "She \n\nchose her colours with the greatest care.\nShe adjusted her petals one by one.\nShe did not wish to \n",
    "go out into the world all rumpled, like the field poppies.\nIt was only in the full radiance of her \n",
    "beauty that she wished to appear.\nOh, yes!\nShe was a coquettish creature!\nAnd her mysterious \nadornment lasted for days and days.\n",
    "Then one morning, exactly at sunrise, she suddenly showed \nherself.\nAnd, after working with all this painstaking precision, she yawned and said: “Ah!\n",
    "I am \nscarcely awake.\nI beg that you will excuse me.\nMy petals are still all disarranged…” But the little \n",
    "prince could not restrain his admiration: \n“Oh!\nHow beautiful you are!” \n“Am I not?” the flower responded, sweetly.\n",
    "“And I was born at the same moment as the sun…” \nThe little prince could guess easily enough that she was not any too modest, but how moving, and \n",
    "exciting she was!\n\n“I think it is time for breakfast,” she added an instant later.\n“If you would have the kindness to \n",
    "think of my needs” And the little prince, completely abashed, went to look for a sprinkling can of \n",
    "fresh water.\n\nSo, he tended the flower.\nSo, too, she began very quickly to torment him with her vanity, which \n",
    "was, if the truth be known, a little difficult to deal with.\n\nOne day, for instance, when she was speaking of her four thorns, she said to the little prince: “Let \n",
    "the tigers come with their claws!” \n“There are no tigers on my planet,” the little prince objected.\n",
    "“And, anyway, tigers do not eat \nweeds.” \n“I am not a weed,” the flower replied, sweetly.\n“Please excuse me…” “I am not at all afraid of \n",
    "tigers,” she went on, “but I have a horror of drafts.\nI suppose you wouldn’t screen for me?\" \n“A horror of drafts, that is bad luck, for a plant,” remarked the little prince, and added to himself, \n",
    "“This flower is a very complex creature…” \n“At night I want you to put me under a glass globe.\nIt is very cold where you live.\n",
    "In the place I \ncame from…” But she interrupted herself at that point.\nShe had come in the form of a seed.\n",
    "She \ncould not have known anything of any other worlds.\n\nEmbarrassed over having let herself be caught on the verge of such an untruth, she coughed two \n",
    "or three times, in order to put the little prince in the wrong.\n\n“The screen?” \n“I was just going to look for it when you spoke to me…” \n",
    "Then she forced her cough a little more so that he should suffer from remorse just the same.\nSo \nthe little prince, in spite of all the good will that was inseparable from his love, had soon come to \n",
    "doubt her.\nHe had taken seriously words which were without importance, and it made him very \nunhappy.\n",
    "\n“I ought not to have listened to her,” he confided to me one day.\n\n“One never ought to listen to the flowers.\n",
    "One should simply look at them and breathe their \n\n\nfragrance.\nMine perfumed all my planet.\nBut I did not know how to take pleasure in all her grace.\n",
    "This tale of claws, which disturbed me so much, should only have filled my heart with tenderness \nand pity.” \n",
    "And he continued his confidences: “The fact is that I did not know how to understand anything!\nI \nought to have judged by deeds and not by words.\n",
    "She cast her fragrance and her radiance over \nme.\nI ought never to have run away from her… I ought to have guessed all the affection that lay \n",
    "behind her poor little stratagems.\nFlowers are so inconsistent!\nBut I was too young to know how to \n",
    "love her…” \nI believe that for his escape he took advantage of the migration of a flock of wild birds.\n",
    "On the \nmorning of his departure he put his planet in perfect order.\nHe carefully cleaned out his active \n",
    "volcanoes.\nHe possessed two active volcanoes; and they were very convenient for heating his \nbreakfast in the morning.\n",
    "He also had one volcano that was extinct.\nBut, as he said, “One never \nknows!” So he cleaned out the extinct volcano, too.\n",
    "If they are well cleaned out, volcanoes burn \nslowly and steadily, without any eruptions.\nVolcanic eruptions are like fires in a chimney.\n",
    "\nOn our earth we are obviously much too small to clean out our volcanoes.\nThat is why they bring \nno end of trouble upon us.\n",
    "The little prince also pulled up, with a certain sense of dejection, the \nlast little shoots of the baobabs.\n",
    "He believed that he would never want to return.\nBut on this last \nmorning all these familiar tasks seemed very precious to him.\n",
    "And when he watered the flower for \nthe last time, and prepared to place her under the shelter of her glass globe, he realised that he \n",
    "was very close to tears.\n“Goodbye,” he said to the flower.\nBut she made no answer.\n“Goodbye,” \nhe said again.\n",
    "The flower coughed.\nBut it was not because she had a cold.\n\n“I have been silly,” she said to him, at last.\n",
    "“I ask your forgiveness.\nTry to be happy…” He was \nsurprised by this absence of reproaches.\nHe stood there all bewildered, the glass globe held \n",
    "arrested in mid-air.\nHe did not understand this quiet sweetness.\n\n“Of course I love you,” the flower said to him.\n",
    "“It is my fault that you have not known it all the \nwhile.\nThat is of no importance.\nBut you, you have been just as foolish as I.\n",
    "Try to be happy… let \nthe glass globe be.\nI don’t want it any more.” \n“But the wind…” “My cold is not so bad as all that… the cool night air will do me good.\n",
    "I am a \nflower.” \n“But the animals…” “Well, I must endure the presence of two or three caterpillars if I wish to \n",
    "become acquainted with the butterflies.\nIt seems that they are very beautiful.\nAnd if not the \nbutterflies and the caterpillars who will call upon me?\n",
    "You will be far away… as for the large \nanimals, I am not at all afraid of any of them.\nI have my claws.” \n",
    "And, naively, she showed her four thorns.\n\nThen she added: “Don’t linger like this.\nYou have decided to go away.\n",
    "Now go!” \nFor she did not want him to see her crying.\nShe was such a proud flower… \n\nHe found himself in the neighbourhood of the asteroids 325, 326, 327, 328, 329, and 330.\n",
    "He \nbegan, therefore, by visiting them, in order to add to his knowledge.\nThe first of them was \ninhabited by a king.\n",
    "Clad in royal purple and ermine, he was seated upon a throne, which was at \n\n\nthe same time both simple and majestic.\n",
    "\n\n“Ah!\nHere is a subject,” exclaimed the king, when he saw the little prince coming.\nAnd the little \n",
    "prince asked himself: “How could he recognise me when he had never seen me before?” \nHe did not know how the world is simplified for kings.\n",
    "To them, all men are subjects.\n“Approach, \nso that I may see you better,” said the king, who felt consumingly proud of being at last a king \n",
    "over somebody.\n\nThe little prince looked everywhere to find a place to sit down; but the entire planet was crammed \n",
    "and obstructed by the king’s magnificent ermine robe.\nSo he remained standing upright, and, since \nhe was tired, he yawned.\n",
    "\n“It is contrary to etiquette to yawn in the presence of a king,” the monarch said to him.\n“I forbid \n",
    "you to do so.” \n“I can’t help it.\nI can’t stop myself,” replied the little prince, thoroughly embarrassed.\n",
    "\n“I have come on a long journey, and I have had no sleep…” \n“Ah, then,” the king said.\n“I order you to yawn.\n",
    "It is years since I have seen anyone yawning.\nYawns, to me, are objects of curiosity.\nCome, now!\nYawn again!\n",
    "It is an order.” \n“That frightens me… I cannot, any more…” murmured the little prince, now completely abashed.\n",
    "\n“Hum!\nHum!” replied the king.\n“Then I… I order you sometimes to yawn and sometimes to” He \nsputtered a little, and seemed vexed.\n",
    "For what the king fundamentally insisted upon was that his \nauthority should be respected.\nHe tolerated no disobedience.\n",
    "He was an absolute monarch.\nBut, \nbecause he was a very good man, he made his orders reasonable.\n\n“If I ordered a general,” he would say, by way of example, “if I ordered a general to change \n",
    "himself into a sea bird, and if the general did not obey me, that would not be the fault of the \ngeneral.\n",
    "It would be my fault.” \n“May I sit down?” came now a timid inquiry from the little prince.\n“I order you to do so,” the king \n",
    "answered him, and majestically gathered in a fold of his ermine mantle.\nBut the little prince was \nwondering… The planet was tiny.\n",
    "Over what could this king really rule?\n\n“Sire,” he said to him, “I beg that you will excuse my asking you a question” \n",
    "“I order you to ask me a question,” the king hastened to assure him.\n“Sire, over what do you \nrule?” “Over everything,” said the king, with magnificent simplicity.\n",
    "\n“Over everything?” The king made a gesture, which took in his planet, the other planets, and all \nthe stars.\n",
    "“Over all that?” asked the little prince.\n“Over all that,” the king answered.\nFor his rule \nwas not only absolute: it was also universal.\n",
    "“And the stars obey you?” “Certainly they do,” the \nking said.\n“They obey instantly.\nI do not permit insubordination.” \n",
    "Such power was a thing for the little prince to marvel at.\nIf he had been master of such complete \nauthority, he would have been able to watch the sunset, not forty-four times in one day, but \n",
    "seventy-two, or even a hundred, or even two hundred times, with out ever having to move his \nchair.\n",
    "And because he felt a bit sad as he remembered his little planet, which he had forsaken, he \nplucked up his courage to ask the king a favour: \n",
    "\n\n“I should like to see a sunset… do me that kindness… Order the sun to set…” \n“If I ordered a general to fly from one flower to another like a butterfly, or to write a tragic \n",
    "drama, or to change himself into a sea bird, and if the general did not carry out the order that he \n",
    "had received, which one of us would be in the wrong?” the king demanded.\n“The general, or \nmyself?” \n",
    "“You,” said the little prince firmly.\n\n“Exactly.\nOne much require from each one the duty which each one can perform,” the king went \n",
    "on.\n“Accepted authority rests first of all on reason.\nIf you ordered your people to go and throw \nthemselves into the sea, they would rise up in revolution.\n",
    "I have the right to require obedience \nbecause my orders are reasonable.” \n“Then my sunset?” the little prince reminded him: for he never forgot a question once he had \n",
    "asked it.\n\n“You shall have your sunset.\nI shall command it.\nBut, according to my science of government, I \n",
    "shall wait until conditions are favourable.” \n“When will that be?” inquired the little prince.\n“Hum!\n",
    "Hum!” replied the king; and before saying \nanything else he consulted a bulky almanac.\n“Hum!\nHum!\nThat will be about… about… that will be \n",
    "this evening about twenty minutes to eight.\nAnd you will see how well I am obeyed.” \nThe little prince yawned.\n",
    "He was regretting his lost sunset.\nAnd then, too, he was already \nbeginning to be a little bored.\n“I have nothing more to do here,” he said to the king.\n",
    "“So I shall set \nout on my way again.” “Do not go,” said the king, who was very proud of having a subject.\n",
    "“Do \nnot go.\nI will make you a Minister!” “Minister of what?” “Minster of…of Justice!” “But there is \n",
    "nobody here to judge!” “We do not know that,” the king said to him.\n“I have not yet made a \ncomplete tour of my kingdom.\n",
    "I am very old.\nThere is no room here for a carriage.\nAnd it tires me \nto walk.” “Oh, but I have looked already!” said the little prince, turning around to give one more \n",
    "glance to the other side of the planet.\n\nOn that side, as on this, there was nobody at all… “Then you shall judge yourself,” the king \n",
    "answered, “that is the most difficult thing of all.\nIt is much more difficult to j udge oneself than to \n",
    "j udge others.\nIf you succeed in j udging yourself rightly, then you are indeed a man of true \nwisdom.” \n",
    "\n“Yes,” said the little prince, “but I can judge myself anywhere.\nI do not need to live on this planet.\n",
    "“Hum!\nHum!” said the king.\n“I have good reason to believe that somewhere on my planet there is \nan old rat.\n",
    "I hear him at night.\nYou can judge this old rat.\nFrom time to time you will condemn him \nto death.\nThus his life will depend on your j ustice.\n",
    "But you will pardon him on each occasion; for \nhe must be treated thriftily.\nHe is the only one we have.” \n",
    "“I,” replied the little prince, “do not like to condemn anyone to death.\nAnd now I think I will go on \n",
    "my way.” “No,” said the king.\nBut the little prince, having now completed his preparations for \ndeparture, had no wish to grieve the old monarch.\n",
    "“If Your Majesty wishes to be promptly \nobeyed,” he said, “he should be able to give me a reasonable order.\n",
    "He should be able, for \nexample, to order me to be gone by the end of one minute.\nIt seems to me that conditions are \n",
    "favourable…” As the king made no answer, the little prince hesitated a moment.\n\nThen, with a sigh, he took his leave.\n",
    "“I made you my Ambassador,” the king called out, hastily.\n\nHe had a magnificent air of authority.\n\n“The grown-ups are very strange,” the little prince said to himself, as he continued on his journey.\n",
    "The second planet was inhabited by a conceited man.\n\n\n\n\n\n“Ah!\nAh!\nI am about to receive a visit from an admirer!” he exclaimed from afar, when he first \n",
    "saw the little prince coming.\nFor, to conceited men, all other men are admirers.\n\n“Good morning,” said the little prince.\n",
    "“That is a queer hat you are wearing.” \n“It is a hat for salutes,” the conceited man replied.\n“It is to raise in salute when people acclaim \n",
    "me.\nUnfortunately, nobody at all ever passes this way.” \n“Yes?” said the little prince, who did not understand what the conceited man was talking about.\n",
    "\n“Clap your hands, one against the other,” the conceited man now directed him.\nThe little prince \nclapped his hands.\n",
    "The conceited man raised his hat in a modest salute.\n“This is more entertaining \nthan the visit to the king,” the little prince said to himself.\n",
    "And he began again to clap his hands, \none against the other.\nThe conceited man against raised his hat in salute.\n",
    "After five minutes of \n\nthis exercise the little prince grew tired of the game’s monotony.\n“And what should one do to \n",
    "make the hat come down?” he asked.\nBut the conceited man did not hear him.\nConceited people \nnever hear anything but praise.\n",
    "\n“Do you really admire me very much?” he demanded of the little prince.\n“What does that mean, \n‘admire’?” \n",
    "“To admire means that you regard me as the handsomest, the best-dressed, the richest, and the \nmost intelligent man on this planet.” “But you are the only man on your planet!” “Do me this \n",
    "kindness.\nAdmire me just the same.” \n“I admire you,” said the little prince, shrugging his shoulders slightly, “but what is there in that to \n",
    "interest you so much?” \nAnd the little prince went away.\n“The grown-ups are certainly very odd,” he said to himself, as he \n",
    "continued on his journey.\n\nThe next planet was inhabited by a tippler.\n\n\nThis was a very short visit, but it plunged the little prince into deep dejection.\n",
    "“What are you \ndoing there?” he said to the tippler, whom he found settled down in silence before a collection of \n",
    "empty bottles and also a collection of full bottles.\n\n“I am drinking,” replied the tippler, with a lugubrious air.\n",
    "\n“Why are you drinking?” demanded the little prince.\n\n“So that I may forget,” replied the tippler.\n“Forget what?” inquired the little prince, who already \n",
    "was sorry for him.\n\n“Forget that I am ashamed,” the tippler confessed, hanging his head.\n\n“Ashamed of what?” insisted the little prince, who wanted to help him.\n",
    "\n“Ashamed of drinking!” The tippler brought his speech to an end, and shut himself up in an \nimpregnable silence.\n",
    "\nAnd the little prince went away, puzzled.\n“The grown-ups are certainly very, very odd,” he said to \n",
    "himself, as he continued on his journey.\n\nThe fourth planet belonged to a businessman.\n\nThis man was so much occupied that he did not even raise his head at the little prince’s arrival.\n",
    "\n\n“Good morning,” the little prince said to him.\n“Your cigarette has gone out.” \n\n“Three and two make five.\n",
    "Five and seven make twelve.\nTwelve and three make fifteen.\nGood \nmorning.\nFifteen and seven make twenty-two.\n",
    "Twenty-two and six make twenty-eight.\nI haven’t \ntime to light it again.\nTwenty-six and five make thirty-one.\n",
    "Phew !\nThen that makes five-hundred- \nand-one-million, six-hundred-twenty-two-thousand, seven-hundred-thirty-one.” \n",
    "“Five hundred million what?” asked the little prince.\n“Eh?\nAre you still there?\nFive-hundred-and- \none million, I can’t stop… I have so much to do!\n",
    "I am concerned with matters of consequence.\nI \ndon’t amuse myself with balderdash.\nTwo and five make seven…” \n",
    "“Five-hundred-and-one million what?” repeated the little prince, who never in his life had let go of \n",
    "a question once he had asked it.\n\nThe businessman raised his head.\n“During the fifty-four years that I have inhabited this planet, I \n",
    "have been disturbed only three times.\nThe first time was twenty-two years ago, when some giddy \ngoose fell from goodness knows where.\n",
    "He made the most frightful noise that resounded all over \nthe place, and I made four mistakes in my addition.\n",
    "The second time, eleven years ago, I was \ndisturbed by an attack of rheumatism.\nI don’t get enough exercise.\n",
    "I have no time for loafing.\nThe \nthird time, well, this is it!\nI was saying, then, five -hundred-and-one millions” \n",
    "“Millions of what?” The businessman suddenly realised that there was no hope of being left in \npeace until he answered this question.\n",
    "\n“Millions of those little objects,” he said, “which one sometimes sees in the sky.” “Flies?” “Oh, \n",
    "no.\nLittle glittering objects.” “Bees?” “Oh, no.\nLittle golden objects that set lazy men to idle \ndreaming.\n",
    "As for me, I am concerned with matters of consequence.\nThere is no time for idle \ndreaming in my life.” “Ah!\n",
    "You mean the stars?” “Yes, that’s it.\nThe stars.” “And what do you do \nwith five-hundred millions of stars?” “Five-hundred-and-one million, six-hundred-twenty-two \n",
    "thousand, seven-hundred-thirty-one.\nI am concerned with matters of consequence: I am \naccurate.” \n“And what do you do with these stars?” “What do I do with them?” “Yes.” “Nothing.\n",
    "I own them.” \n“You own the stars?” “Yes.” “But I have already seen a king who…” “Kings do not own, they \n",
    "reign over.\nIt is a very different matter.” \n“And what good does it do you to own the stars?” “It does me the good of making me rich.” \n",
    "“And what good does it do you to be rich?” \n“It makes it possible for me to buy more stars, if any are ever discovered.” \n",
    "“This man,” the little prince said to himself, “reasons a little like my poor tippler…” Nevertheless, \n",
    "he still had some more questions.\n“How is it possible for one to own the stars?” “To whom do they \nbelong?” the businessman retorted, peevishly.\n",
    "“I don’t know.\nTo nobody.” “Then they belong to \nme, because I was the first person to think of it.” “Is that all that is necessary?” “Certainly.\n",
    "\nWhen you find a diamond that belongs to nobody, it is yours.\nWhen you discover an island that \nbelongs to nobody, it is yours.\n",
    "When you get an idea before any one else, you take out a patent on \nit: it is yours.\nSo with me: I own the stars, because nobody else before me ever thought of owning \n",
    "them.” \n“Yes, that is true,” said the little prince.\n“And what do you do with them?” \n\n\n“I administer them,” replied the businessman.\n",
    "“I count them and recount them.\nIt is difficult.\nBut I \nam a man who is naturally interested in matters of consequence.” \n",
    "The little prince was still not satisfied.\n“If I owned a silk scarf,” he said, “I could put it around my \n",
    "neck and take it away with me.\nIf I owned a flower, I could pluck that flower and take it away with \n",
    "me.\nBut you cannot pluck the stars from heaven…” \n“No.\nBut I can put them in the bank.” “Whatever does that mean?” “That means that I write the \n",
    "number of my stars on a little paper.\nAnd then I put this paper in a drawer and lock it with a key.” \n",
    "“And that is all?” \n“That is enough,” said the businessman.\n\n“It is entertaining,” thought the little prince.\n",
    "“It is rather poetic.\nBut it is of no great \nconsequence.” On matters of consequence, the little prince had ideas, which were very different \n",
    "from those of the grown-ups.\n\n“I myself own a flower,” he continued his conversation with the businessman, “which I water \n",
    "every day.\nI own three volcanoes, which I clean out every week (for I also clean out the one that is \n",
    "extinct; one never knows).\nIt is of some use to my volcanoes, and it is of some use to my flower, \nthat I own them.\n",
    "But you are of no use to the stars…” \nThe businessman opened his mouth, but he found nothing to say in answer.\n",
    "And the little prince \nwent away.\n“The grown-ups are certainly altogether extraordinary,” he said simply, talking to \n",
    "himself as he continued on his journey.\n\nThe fifth planet was very strange.\nIt was the smallest of all.\n",
    "There was just enough room on it for \na street lamp and a lamplighter.\n\n\nThe little prince was not able to reach any explanation of the use of a street lamp and a \n",
    "lamplighter, somewhere in the heavens, on a planet, which had no people, and not one house.\n\nBut he said to himself, nevertheless: “It may well be that this man is absurd.\n",
    "But he is not so \nabsurd as the king, the conceited man, the businessman, and the tippler.\nFor at least his work has \n",
    "\nsome meaning.\nWhen he lights his street lamp, it is as if he brought one more star to life, or one \n",
    "flower.\nWhen he puts out his lamp, he sends the flower, or the star, to sleep.\nThat is a beautiful \n",
    "occupation.\nAnd since it is beautiful, it is truly useful.” \nWhen he arrived on the planet he respectfully saluted the lamplighter.\n",
    "\n“Good morning.\nWhy have you just put out your lamp?” \n“Those are the orders,” replied the lamplighter.\n",
    "“Good morning.” \n“What are the orders?” \n“The orders are that I put out my lamp.\nGood evening.” And he lighted his lamp again.\n",
    "“But why \nhave you just lighted it again?” \n“Those are the orders,” replied the lamplighter.\n\n“I do not understand,” said the little prince.\n",
    "\n“There is nothing to understand,” said the lamplighter.\n“Orders are orders.\nGood morning.” And \nhe put out his lamp.\n",
    "\nThen he mopped his forehead with a handkerchief decorated with red squares.\n\n“I follow a terrible profession.\n",
    "In the old days it was reasonable.\nI put the lamp out in the morning, \nand in the evening I lighted it again.\n",
    "I had the rest of the day for relaxation and the rest of the \nnight for sleep.” \n“And the orders have been changed since that time?” \n",
    "“The orders have not been changed,” said the lamplighter.\n“That is the tragedy!\nFrom year to \nyear the planet has turned more rapidly and the orders have not been changed!” \n",
    "“Then what?” asked the little prince.\n\n“Then the planet now makes a complete turn every minute, and I no longer have a single second \n",
    "for repose.\nOnce every minute I have to light my lamp and put it out!” \n“That is very funny!\nA day lasts only one minute, here where you live!” \n",
    "“It is not funny at all!” said the lamplighter.\n“While we have been talking together a month has \ngone by.” \n",
    "“A month?” \n\n“Yes, a month.\nThirty minutes.\nThirty days.\nGood evening.” And he lighted his lamp again.\n",
    "As the \nlittle prince watched him, he felt that he loved this lamplighter who was so faithful to his orders.\n",
    "He remembered the sunsets, which he himself had gone to seek, in other days, merely by pulling \nup his chair; and he wanted to help his friend.\n",
    "\n“You know,” he said, “I can tell you a way you can rest whenever you want to…” \n“I always want to rest,” said the lamplighter.\n",
    "For it is possible for a man to be faithful and lazy at \nthe same time.\n\n\nThe little prince went on with his explanation: “Your planet is so small that three strides will take \n",
    "you all the way around it.\nTo be always in the sunshine, you need only walk along rather slowly.\nWhen you want to rest, you will walk and the day will last as long as you like.” \n",
    "“That doesn’t do me much good,” said the lamplighter.\n“The one thing I love in life is to sleep.” \n“Then you’re unlucky,” said the little prince.\n",
    "\n“I am unlucky,” said the lamplighter.\n“Good morning.” And he put out his lamp.\n\n“That man,” said the little prince to himself, as he continued farther on his journey, “that man \n",
    "would be scorned by all the others: by the king, by the conceited man, by the tippler, by the \nbusinessman.\n",
    "Nevertheless he is the only one of them all who does not seem to me ridiculous.\nPerhaps that is because he is thinking of something else besides himself.” \n",
    "He breathed a sigh of regret, and said to himself, again: “That man is the only one of them all \nwhom I could have made my friend.\n",
    "But his planet is indeed too small.\nThere is no room on it for \ntwo people…” What the little prince did not dare confess was that he was sorry most of all to leave \n",
    "this planet, because it was blest every day with 1440 sunsets!\n\nThe sixth planet was ten times larger than the last one.\n",
    "It was inhabited by an old gentleman who \nwrote voluminous books.\n\n\n“Oh, look!\nHere is an explorer!” he exclaimed to himself when he saw the little prince coming.\n",
    "\nThe little prince sat down on the table and panted a little.\nHe had already travelled so much and \n",
    "so far!\n\n“Where do you come from?” the old gentleman said to him.\n\n“What is that big book?” said the little prince.\n",
    "“What are you doing?” \n“I am a geographer,” the old gentleman said to him.\n\n“What is a geographer?” asked the little prince.\n",
    "“A geographer is a scholar who knows the \nlocation of all the seas, rivers, towns, mountains, and deserts.” \n",
    "“That is very interesting,” said the little prince.\n“Here at last is a man who has a real profession!” \n",
    "And he cast a look around him at the planet of the geographer.\n\n\nIt was the most magnificent and stately planet that he had ever seen.\n",
    "\n“Your planet is very beautiful,” he said.\n“Has it any oceans?” \n“I couldn’t tell you,” said the geographer.\n",
    "\n“Ah!” The little prince was disappointed.\n“Has it any mountains?” \n“I couldn’t tell you,” said the geographer.\n",
    "\n“And towns, and rivers, and deserts?” \n“I couldn’t tell you that, either.” \n“But you are a geographer!” \n",
    "“Exactly,” the geographer said.\n“But I am not an explorer.\nI haven’t a single explorer on my \nplanet.\n",
    "It is not the geographer who goes out to count the towns, the rivers, the mountains, the \nseas, the oceans, and the deserts.\n",
    "The geographer is much too important to go loafing about.\nHe \ndoes not leave his desk.\nBut he receives the explorers in his study.\n",
    "He asks them questions, and \nhe notes down what they recall of their travels.\nAnd if the recollections of any one among them \n",
    "seem interesting to him, the geographer orders an inquiry into that explorer’s moral character.” \n“Why is that?” \n",
    "“Because an explorer who told lies would bring disaster on the books of the geographer.\nSo would \nan explorer who drank too much.” \n",
    "“Why is that?” asked the little prince.\n\n“Because intoxicated men see double.\nThen the geographer would note down two mountains in a \n",
    "place where there was only one.” \n“I know some one,” said the little prince, “who would make a bad explorer.” \n",
    "“That is possible.\nThen, when the moral character of the explorer is shown to be good, an inquiry \nis ordered into his discovery.” \n",
    "“One goes to see it?” \n“No.\nThat would be too complicated.\nBut one requires the explorer to furnish proofs.\n",
    "For example, \nif the discovery in question is that of a large mountain, one requires that large stones be brought \n",
    "back from it.” The geographer was suddenly stirred to excitement.\n“But you come from far away!\nYou are an explorer!\n",
    "You shall describe your planet to me!” And, having opened his big register, \nthe geographer sharpened his pencil.\n",
    "The recitals of explorers are put down first in pencil.\nOne \nwaits until the explorer has furnished proofs, before putting them down in ink.\n",
    "“Well?” said the \ngeographer expectantly.\n\n“Oh, where I live,” said the little prince, “it is not very interesting.\n",
    "It is all so small.\nI have three \nvolcanoes.\nTwo volcanoes are active and the other is extinct.\nBut one never knows.” \n",
    "“One never knows,” said the geographer.\n\n\n“I have also a flower.” \n\n\n“We do not record flowers,” said the geographer.\n",
    "\n“Why is that?\nThe flower is the most beautiful thing on my planet!” \n“We do not record them,” said the geographer, “because they are ephemeral.” \n",
    "“What does that mean ‘ephemeral’?” \n“Geographies,” said the geographer, “are the books which, of all books, are most concerned with \n",
    "matters of consequence.\nThey never become old-fashioned.\nIt is very rarely that a mountain \nchanges its position.\n",
    "It is very rarely that an ocean empties itself of its waters.\nWe write of eternal \nthings.” \n“But extinct volcanoes may come to life again,” the little prince interrupted.\n",
    "\n“What does that mean ‘ephemeral’?” \n“Whether volcanoes are extinct or alive, it comes to the same thing for us,” said the geographer.\n",
    "“The thing that matters to us is the mountain.\nIt does not change.” \n“But what does that mean ‘ephemeral’?” repeated the little prince, who never in his life had let go \n",
    "of a question, once he had asked it.\n\n“It means, ‘which is in danger of speedy disappearance.’ “ \n“Is my flower in danger of speedy disappearance?” \n",
    "“Certainly it is.” \n“My flower is ephemeral,” the little prince said to himself, “and she has only four thorns to \n",
    "defend herself against the world.\nAnd I have left her on my planet, all alone!” \nThat was his first moment of regret.\n",
    "But he took courage once more.\n“What place would you \nadvise me to visit now?” he asked.\n“The planet Earth,” replied the geographer.\n",
    "“It has a good \nreputation.” And the little prince went away, thinking of his flower.\n\n\nSo then the seventh planet was the Earth.\n",
    "\nThe Earth is not just an ordinary planet!\n\nOne can count, there 111 kings (not forgetting, to be sure, the Negro kings among them), 7000 \n",
    "geographers, 900,000 businessmen, 7,500,000 tipplers, 311,000,000 conceited men, that is to say, \nabout 2,000,000,000 grown-ups.\n",
    "\nTo give you an idea of the size of the Earth, I will tell you that before the invention of electricity it \n",
    "was necessary to maintain, over the whole of the six continents, a veritable army of 462,511 \nlamplighters for the street lamps.\n",
    "Seen from a slight distance, that would make a splendid \nspectacle.\n\nThe movements of this army would be regulated like those of the ballet in the opera.\n",
    "First would \ncome the turn of the lamplighters of New Zealand and Australia.\nHaving set their lamps alight, \n",
    "these would go off to sleep.\nNext, the lamplighters of China and Siberia would enter for their steps \n",
    "in the dance, and then they too would be waved back into the wings.\nAfter that would come the \nturn of the lamplighters of Russia and the Indies; then those of Africa and Europe, then those of \n",
    "South America; then those of North America.\nAnd never would they make a mistake in the order \nof their entry upon the stage.\n",
    "It would be magnificent.\n\nOnly the man who was in charge of the single lamp at the North Pole, and his colleague who was \n",
    "responsible for the single lamp at the South Pole, only these two would live free from toil and \ncare: they would be busy twice a year.\n",
    "\nWhen one wishes to play the wit, he sometimes wanders a little from the truth.\n\nI have not been altogether honest in what I have told you about the lamplighters.\n",
    "And I realise \nthat I run the risk of giving a false idea of our planet to those who do not know it.\n",
    "\nMen occupy a very small place upon the Earth.\nIf the two billion inhabitants who people its \nsurface were all to stand upright and somewhat crowded together, as they do for some big public \n",
    "assembly, they could easily be put into one public square twenty miles long and twenty miles wide.\nAll humanity could be piled up on a small Pacific islet.\n",
    "\nThe grown-ups, to be sure, will not believe you when you tell them that.\nThey imagine that they fill \n",
    "a great deal of space.\nThey fancy themselves as important as the baobabs.\nYou should advise \nthem, then, to make their own calculations.\n",
    "They adore figures, and that will please them.\nBut do \nnot waste your time on this extra task.\nIt is unnecessary.\n",
    "You have, I know, confidence in me.\n\nWhen the little prince arrived on the Earth, he was very much surprised not to see any people.\n",
    "He \nwas beginning to be afraid he had come to the wrong planet, when a coil of gold, the colour of the \n",
    "moonlight, flashed across the sand.\n\n“Good evening,” said the little prince courteously.\n\n“Good evening,” said the snake.\n",
    "\n“What planet is this on which I have come down?” asked the little prince.\n\n“This is the Earth; this is Africa,” the snake answered.\n",
    "\n“Ah!\nThen there are no people on the Earth?” \n\n\n“This is the desert.\nThere are no people in the desert.\n",
    "The Earth is large,” said the snake.\n\nThe little prince sat down on a stone, and raised his eyes toward the sky.\n",
    "\n“I wonder,” he said, “whether the stars are set alight in heaven so that one day each one of us \nmay find his own again… Look at my planet.\n",
    "It is right there above us.\nBut how far away it is!” \n“It is beautiful,” the snake said.\n“What has brought you here?” \n",
    "“I have been having some trouble with a flower,” said the little prince.\n“Ah!” said the snake.\nAnd \n",
    "they were both silent.\n\n“Where are the men?” the little prince at last took up the conversation again.\n",
    "“It is a little lonely \nin the desert…” \n“It is also lonely among men,” the snake said.\nThe little prince gazed at him for a long time.\n",
    "\n“You are a funny animal,” he said at last.\n“You are no thicker than a finger…” \n“But I am more powerful than the finger of a king,” said the snake.\n",
    "\nThe little prince smiled.\n“You are not very powerful.\nYou haven’t even any feet.\nYou cannot even \ntravel…” \n",
    "“I can carry you farther than any ship could take you,” said the snake.\nHe twined himself around \nthe little prince’s ankle, like a golden bracelet.\n",
    "\n“Whomever I touch, I send back to the earth from whence he came,” the snake spoke again.\n“But \nyou are innocent and true, and you come from a star…” \n",
    "The little prince made no reply.\n“You move me to pity, you are so weak on this Earth made of \ngranite,” the snake said.\n",
    "“I can help you, some day, if you grow too homesick for your own planet.\nI can…” \n“Oh!\nI understand you very well,” said the little prince.\n",
    "“But why do you always speak in \nriddles?” \n“I solve them all,” said the snake.\nAnd they were both silent.\n",
    "\nThe little prince crossed the desert and met with only one flower.\n\nIt was a flower with three petals, a flower of no account at all.\n",
    "\n“Good morning,” said the little prince.\n\n“Good morning,” said the flower.\n\n“Where are the men?” the little prince asked, politely.\n",
    "The flower had once seen a caravan \npassing.\n\n“Men?” she echoed.\n“I think there are six or seven of them in existence.\n",
    "I saw them, several \nyears ago.\nBut one never knows where to find them.\nThe wind blows them away.\nThey have no \n",
    "roots, and that makes their life very difficult.” \n\n“Goodbye,” said the little prince.\n\n\n“Goodbye,” said the flower.\n",
    "\n\nAfter that, the little prince climbed a high mountain.\nThe only mountains he had ever known were \n",
    "the three volcanoes, which came up to his knees.\nAnd he used the extinct volcano as a footstool.\n\n“From a mountain as high as this one,” he said to himself, “I shall be able to see the whole planet \n",
    "at one glance, and all the people…” But he saw nothing, save peaks of rock that were sharpened \nlike needles.\n",
    "\n\n“Good morning,” he said courteously.\n\n“Good morning…Good morning…Good morning,” answered the echo.\n",
    "\n“Who are you?” said the little prince.\n\n“Who are you…Who are you…Who are you?” answered the echo.\n\n",
    "“Be my friends.\nI am all alone,” he said.\n\n“I am all alone…all alone…all alone,” answered the echo.\n",
    "\n“What a queer planet!” he thought.\n“It is altogether dry, and altogether pointed, and altogether \nharsh and forbidding.\n",
    "And the people have no imagination.\nThey repeat whatever one says to \nthem… On my planet I had a flower; she always was the first to speak…” \n",
    "But it happened that after walking for a long time through sand, and rocks, and snow, the little \nprince at last came upon a road.\n",
    "And all roads lead to the abodes of men.\n\n“Good morning,” he said.\nHe was standing before a garden, all a-bloom with roses.\n",
    "\n“Good morning,” said the roses.\n\nThe little prince gazed at them.\nThey all looked like his flower.\n",
    "\n“Who are you?” he demanded, thunderstruck.\n\n“We are roses,” the roses said.\nAnd he was overcome with sadness.\n",
    "His flower had told him that \nshe was the only one of her kind in all the universe.\nAnd here were five thousand of them, all \n",
    "alike, in one single garden!\n\n“She would be very much annoyed,” he said to himself, “if she should see that… she would cough \n",
    "\nmost dreadfully, and she would pretend that she was dying, to avoid being laughed at.\nAnd I \nshould be obliged to pretend that I was nursing her back to life, for if I did not do that, to humble \n",
    "myself also, she would really allow herself to die…” \nThen he went on with his reflections: “I thought that I was rich, with a flower that was unique in all \n",
    "the world; and all I had was a common rose.\nA common rose, and three volcanoes that come up to \nmy knees — and one of them perhaps extinct forever… that doesn’t make me a very great \n",
    "prince…” And he lay down in the grass and cried.\n\nIt was then that the fox appeared.\n\n“Good morning,” said the fox.\n",
    "\n“Good morning,” the little prince responded politely, although when he turned around he saw \nnothing.\n",
    "\n“I am right here,” the voice said, “under the apple tree.” “ \nWho are you?” asked the little prince, and added, “You are very pretty to look at.” \n",
    "“I am a fox,” said the fox.\n\n“Come and play with me,” proposed the little prince.\n\n“I am so unhappy.” “I cannot play with you,” the fox said.\n",
    "“I am not tamed.” \n“Ah!\nPlease excuse me,” said the little prince.\nBut, after some thought, he added: “What does \n",
    "that mean, ‘tame’?” \n\n\n“You do not live here,” said the fox.\n“What is it that you are looking for?” \n",
    "“I am looking for men,” said the little prince.\n“What does that mean, ‘tame’?” \n“Men,” said the fox.\n",
    "“They have guns, and they hunt.\nIt is very disturbing.\nThey also raise \nchickens.\nThese are their only interests.\n",
    "Are you looking for chickens?” \n“No,” said the little prince.\n“I am looking for friends.\nWhat does that mean, ‘tame’?” \n",
    "“It is an act too often neglected,” said the fox.\nIt means to establish ties.” \n\n“‘To establish ties’?” \n",
    "\n“Just that,” said the fox.\n“To me, you are still nothing more than a little boy who is just like a \n",
    "hundred thousand other little boys.\nAnd I have no need of you.\nAnd you, on your part, have no \nneed of me.\n",
    "To you, I am nothing more than a fox like a hundred thousand other foxes.\nBut if you \ntame me, then we shall need each other.\n",
    "To me, you will be unique in all the world.\nTo you, I shall \nbe unique in all the world…” \n“I am beginning to understand,” said the little prince.\n",
    "“There is a flower… I think that she has \ntamed me…” \n“It is possible,” said the fox.\n“On the Earth one sees all sorts of things.” \n",
    "“Oh, but this is not on the Earth!” said the little prince.\nThe fox seemed perplexed, and very \ncurious.\n",
    "\n“On another planet?” \n“Yes.” \n“Are there hunters on this planet?” \n“No.” \n“Ah, that is interesting!\n",
    "Are there chickens?” \n“No.” \n“Nothing is perfect,” sighed the fox.\nBut he came back to his idea.\n“My life is very monotonous,” \n",
    "the fox said.\n“I hunt chickens; men hunt me.\nAll the chickens are just alike, and all the men are \njust alike.\n",
    "And, in consequence, I am a little bored.\nBut if you tame me, it will be as if the sun \ncame to shine on my life.\n",
    "I shall know the sound of a step that will be different from all the others.\nOther steps send me hurrying back underneath the ground.\n",
    "Yours will call me, like music, out of \nmy burrow.\nAnd then look: you see the grain-fields down yonder?\n",
    "I do not eat bread.\nWheat is of \nno use to me.\nThe wheat fields have nothing to say to me.\nAnd that is sad.\n",
    "But you have hair that \nis the colour of gold.\nThink how wonderful that will be when you have tamed me!\n",
    "The grain, which \nis also golden, will bring me back the thought of you.\nAnd I shall love to listen to the wind in the \n",
    "wheat…” The fox gazed at the little prince, for a long time.\n“Please, tame me!” he said.\n\n“I want to, very much,” the little prince replied.\n",
    "“But I have not much time.\nI have friends to \ndiscover, and a great many things to understand.” \n“One only understands the things that one tames,” said the fox.\n",
    "“Men have no more time to \nunderstand anything.\nThey buy things all ready-made at the shops.\nBut there is no shop anywhere \n",
    "where one can buy friendship, and so men have no friends any more.\nIf you want a friend, tame \nme…” \n",
    "“What must I do, to tame you?” asked the little prince.\n\n“You must be very patient,” replied the fox.\n",
    "“First you will sit down at a little distance from me, \nlike that, in the grass.\nI shall look at you out of the corner of my eye, and you will say nothing.\n",
    "Words are the source of misunderstandings.\nBut you will sit a little closer to me, every day…” \n\n\nThe next day the little prince came back.\n",
    "\n\n“It would have been better to come back at the same hour,” said the fox.\n“If, for example, you \ncome at four o’clock in the afternoon, then at three o’clock I shall begin to be happy.\n",
    "I shall feel \nhappier and happier as the hour advances.\nAt four o’clock, I shall already be worrying and \n",
    "jumping about.\nI shall show you how happy I am!\nBut if you come at just any time, I shall never \nknow at what hour my heart is to be ready to greet you… One must observe the proper rites…” \n",
    "“What is a rite?” asked the little prince.\n\n“Those also are actions too often neglected,” said the fox.\n",
    "“They are what make one day \ndifferent from other days, one hour from other hours.\nThere is a rite, for example, among my \n",
    "hunters.\nEvery Thursday they dance with the village girls.\nSo Thursday is a wonderful day for me!\nI can take a walk as far as the vineyards.\n",
    "But if the hunters danced at just any time, every day \nwould be like every other day, and I should never have any vacation at all.” \n",
    "So the little prince tamed the fox.\nAnd when the hour of his departure drew near… \n“Ah,” said the fox, “I shall cry.” \n",
    "“It is your own fault,” said the little prince.\n“I never wished you any sort of harm; but you wanted \n",
    "me to tame you…” \n“Yes, that is so,” said the fox.\n\n“But now you are going to cry!” said the little prince.\n",
    "\n“Yes, that is so,” said the fox.\n\n“Then it has done you no good at all!” \n“It has done me good,” said the fox, “because of the colour of the wheat fields.” And then he \n",
    "added: “Go and look again at the roses.\nYou will understand now that yours is unique in all the \nworld.\n",
    "Then come back to say goodbye to me, and I will make you a present of a secret.” \nThe little prince went away, to look again at the roses.\n",
    "“You are not at all like my rose,” he said.\n“As yet you are nothing.\nNo one has tamed you, and you have tamed no one.\n",
    "You are like my fox \nwhen I first knew him.\nHe was only a fox like a hundred thousand other foxes.\nBut I have made \n",
    "him my friend, and now he is unique in all the world.” And the roses were very much embarrassed.\n“You are beautiful, but you are empty,” he went on.\n",
    "“One could not die for you.\nTo be sure, an \nordinary passer-by would think that my rose looked just like you, the rose that belongs to me.\n",
    "But \nin herself alone she is more important than all the hundreds of you other roses: because it is she \n",
    "that I have watered; because it is she that I have put under the glass globe; because it is she that \n",
    "I have sheltered behind the screen; because it is for her that I have killed the caterpillars (except \n",
    "the two or three that we saved to become butterflies); because it is she that I have listened to, \nwhen she grumbled, or boasted, or even sometimes when she said nothing.\n",
    "Because she is my \nrose.\n\nAnd he went back to meet the fox.\n“Goodbye,” he said.\n\n“Goodbye,” said the fox.\n",
    "“And now here is my secret, a very simple secret: It is only with the \nheart that one can see rightly; what is essential is invisible to the eye.” \n",
    "\n\n“What is essential is invisible to the eye,” the little prince repeated, so that he would be sure to \n",
    "remember.\n\n“It is the time you have wasted for your rose that makes your rose so important.” \n“It is the time I have wasted for my rose…” said the little prince, so that he would be sure to \n",
    "remember.\n\n“Men have forgotten this truth,” said the fox.\n“But you must not forget it.\nYou become \nresponsible, forever, for what you have tamed.\n",
    "You are responsible for your rose…” \n“I am responsible for my rose,” the little prince repeated, so that he would be sure to remember.\n",
    "\n“Good morning,” said the little prince.\n\n“Good morning,” said the railway switchman.\n\n“What do you do here?” the little prince asked.\n",
    "\n“I sort out travellers, in bundles of a thousand,” said the switchman.\n“I send off the trains that \n",
    "carry them; now to the right, now to the left.” And a brilliantly lighted express train shook the \nswitchman’s cabin as it rushed by with a roar like thunder.\n",
    "\n“They are in a great hurry,” said the little prince.\n“What are they looking for?” \n“Not even the locomotive engineer knows that,” said the switchman.\n",
    "And a second brilliantly \nlighted express thundered by, in the opposite direction.\n\n“Are they coming back already?” demanded the little prince.\n",
    "“These are not the same ones,” said \nthe switchman.\n“It is an exchange.” \n“Were they not satisfied where they were?” asked the little prince.\n",
    "\n“No one is ever satisfied where he is,” said the switchman.\nAnd they heard the roaring thunder of \n",
    "a third brilliantly lighted express.\n\n“Are they pursuing the first travellers?” demanded the little prince.\n",
    "\n“They are pursuing nothing at all,” said the switchman.\n“They are asleep in there, or if they are \n",
    "not asleep they are yawning.\nOnly the children are flattening their noses against the \nwindowpanes.” \n",
    "“Only the children know what they are looking for,” said the little prince.\n\n“They waste their time over a rag doll and it becomes very important to them; and if anybody \n",
    "takes it away from them, they cry…” “They are lucky,” the switchman said.\n\n“Good morning,” said the little prince.\n",
    "\n“Good morning,” said the merchant.\n\nThis was a merchant who sold pills that had been invented to quench thirst.\n",
    "You need only swallow \none pill a week, and you would feel no need of anything to drink.\n\n\n“Why are you selling those?” asked the little prince.\n",
    "\n\n“Because they save a tremendous amount of time,” said the merchant.\n“Computations have been \nmade by experts.\n",
    "With these pills, you save fifty-three minutes in every week.” \n“And what do I do with those fifty-three minutes?” \n",
    "“Anything you like…” \n“As for me,” said the little prince to himself, “if I had fifty-three minutes to spend as I liked, I \n",
    "should walk at my leisure toward a spring of fresh water.” \nIt was now the eighth day since I had had my accident in the desert, and I had listened to the story \n",
    "of the merchant as I was drinking the last drop of my water supply.\n\n“Ah,” I said to the little prince, “these memories of yours are very charming; but I have not yet \n",
    "succeeded in repairing my plane; I have nothing more to drink; and I, too, should be very happy if \n",
    "I could walk at my leisure toward a spring of fresh water!” \n“My friend the fox…” the little prince said to me.\n",
    "\n“My dear little man, this is no longer a matter that has anything to do with the fox!” \n“Why not?” \n",
    "“Because I am about to die of thirst…” \nHe did not follow my reasoning, and he answered me: “It is a good thing to have had a friend, \n",
    "even if one is about to die.\nI, for instance, am very glad to have had a fox as a friend…” \n“He has no way of guessing the danger,” I said to myself.\n",
    "“He has never been either hungry or \nthirsty.\nA little sunshine is all he needs…” \nBut he looked at me steadily, and replied to my thought: “I am thirsty, too.\n",
    "Let us look for a \nwell…” I made a gesture of weariness.\nIt is absurd to look for a well, at random, in the immensity \n",
    "of the desert.\nBut nevertheless we started walking.\n\nWhen we had trudged along for several hours, in silence, the darkness fell, and the stars began to \n",
    "come out.\nThirst had made me a little feverish, and I looked at them as if I were in a dream.\nThe \nlittle prince’s last words came reeling back into my memory: “Then you are thirsty, too?” I \n",
    "demanded.\nBut he did not reply to my question.\nHe merely said to me: “Water may also be good \nfor the heart…” \n",
    "I did not understand this answer, but I said nothing.\nI knew very well that it was impossible to \ncross-examine him.\n",
    "He was tired.\nHe sat down.\nI sat down beside him.\nAnd, after a little silence, \nhe spoke again: “The stars are beautiful, because of a flower that cannot be seen.” \n",
    "I replied, “Yes, that is so.” And, without saying anything more, I looked across the ridges of sand \n",
    "that were stretched out before us in the moonlight.\n\n“The desert is beautiful,” the little prince added.\n",
    "\nAnd that was true.\nI have always loved the desert.\nOne sits down on a desert sand dune, sees \n\n\nnothing, hears nothing.\n",
    "Yet through the silence something throbs, and gleams… \n“What makes the desert beautiful,” said the little prince, “is that somewhere it hides a well…” \n",
    "I was astonished by a sudden understanding of that mysterious radiation of the sands.\nWhen I was \na little boy I lived in an old house, and legend told us that a treasure was buried there.\n",
    "To be sure, \nno one had ever known how to find it; perhaps no one had ever even looked for it.\nBut it cast an \n",
    "enchantment over that house.\nMy home was hiding a secret in the depths of its heart… “Yes,” I \nsaid to the little prince.\n",
    "“The house, the stars, the desert — what gives them their beauty is \nsomething that is invisible!” \n",
    "“I am glad,” he said, “that you agree with my fox.” As the little prince dropped off to sleep, I took \n",
    "him in my arms and set out walking once more.\nI felt deeply moved, and stirred.\nIt seemed to me \nthat I was carrying a very fragile treasure.\n",
    "It seemed to me, even, that there was nothing more \nfragile on all Earth.\nIn the moonlight I looked at his pale forehead, his closed eyes, his locks of \n",
    "hair that trembled in the wind, and I said to myself: \n“What I see here is nothing but a shell.\nWhat is most important is invisible…” \n",
    "As his lips opened slightly with the suspicious of a half-smile, I said to myself, again: “What \nmoves me so deeply, about this little prince who is sleeping here, is his loyalty to a flower — the \n",
    "image of a rose that shines through his whole being like the flame of a lamp, even when he is \nasleep…” \n",
    "And I felt him to be more fragile still.\nI felt the need of protecting him, as if he himself were a \n",
    "flame that might be extinguished by a little puff of wind… And, as I walked on so, I found the well, \n",
    "at daybreak.\n\n“Men,” said the little prince, “set out on their way in express trains, but they do not know what \n",
    "they are looking for.\nThen they rush about, and get excited, and turn round and round…” And he \nadded: “It is not worth the trouble…” \n",
    "\nThe well that we had come to was not like the wells of the Sahara.\nThe wells of the Sahara are \nmere holes dug in the sand.\n",
    "This one was like a well in a village.\nBut there was no village here, \nand I thought I must be dreaming… \n",
    "“It is strange,” I said to the little prince.\n“Everything is ready for use: the pulley, the bucket, the \n",
    "rope…” He laughed, touched the rope, and set the pulley to working.\nAnd the pulley moaned, like \nan old weathervane, which the wind has long since forgotten.\n",
    "\n“Do you hear?” said the little prince.\n“We have wakened the well, and it is singing…” \nI did not want him to tire himself with the rope.\n",
    "\n“Leave it to me,” I said.\n“It is too heavy for you.” I hoisted the bucket slowly to the edge of the \n",
    "well and set it there, happy, tired as I was, over my achievement.\nThe song of the pulley was still \n",
    "in my ears, and I could see the sunlight shimmer in the still trembling water.\n\n“I am thirsty for this water,” said the little prince.\n",
    "“Give me some of it to drink…” \nAnd I understood what he had been looking for.\nI raised the bucket to his lips.\n",
    "He drank, his eyes \nclosed.\nIt was as sweet as some special festival treat.\nThis water was indeed a different thing from \n",
    "ordinary nourishment.\nIts sweetness was born of the walk under the stars, the song of the pulley, \nthe effort of my arms.\n",
    "It was good for the heart, like a present.\nWhen I was a little boy, the lights \nof the Christmas tree, the music of the Midnight Mass, the tenderness of smiling faces, used to \n",
    "make up, so, the radiance of the gifts I received.\n\n“The men where you live,” said the little prince, “raise five thousand roses in the same garden \n",
    "and they do not find in it what they are looking for.” \n“They do not find it,” I replied.\n\n“And yet what they are looking for could be found in one single rose, or in a little water.” \n",
    "“Yes, that is true,” I said.\n\nAnd the little prince added: “But the eyes are blind.\nOne must look with the heart…” \n",
    "I had drunk the water.\nI breathed easily.\nAt sunrise the sand is the colour of honey.\nAnd that \nhoney colour was making me happy, too.\n",
    "What brought me, then, this sense of grief?\n\n“You must keep your promise,” said the little prince, softly, as he sat down beside me once more.\n",
    "“What promise?” “You know, a muzzle for my sheep… I am responsible for this flower…” \nI took my rough drafts of drawings out of my pocket.\n",
    "The little prince looked them over, and \nlaughed as he said: \n“Your baobabs, they look a little like cabbages.” \n",
    "“Oh!” I had been so proud of my baobabs!\n“Your fox, his ears look a little like horns; and they are \n",
    "too long.” And he laughed again.\n\n“You are not fair, little prince,” I said.\n“I don’t know how to draw anything except boa constrictors \n",
    "from the outside and boa constrictors from the inside.” \n\n\n“Oh, that will be all right,” he said, “children understand.” \n",
    "So then I made a pencil sketch of a muzzle.\nAnd as I gave it to him my heart was torn.\n\n“You have plans that I do not know about,” I said.\n",
    "But he did not answer me.\nHe said to me, \ninstead: “You know, my descent to the earth… Tomorrow will be its anniversary.” Then, after a \n",
    "silence, he went on: “I came down very near here.” And he flushed.\n\nAnd once again, without understanding why, I had a queer sense of sorrow.\n",
    "One question, \nhowever, occurred to me: “Then it was not by chance that on the morning when I first met you — a \n",
    "week ago — you were strolling along like that, all alone, a thousand miles from any inhabited \nregion?\n",
    "You were on the your way back to the place where you landed?” \nThe little prince flushed again.\nAnd I added, with some hesitancy: “Perhaps it was because of the \n",
    "anniversary?” The little prince flushed once more.\nHe never answered questions, but when one \nflushes does that not mean “Yes”?\n",
    "\n“Ah,” I said to him, “I am a little frightened…” \nBut he interrupted me.\n“Now you must work.\nYou must return to your engine.\n",
    "I will be waiting for \nyou here.\nCome back tomorrow evening…” \nBut I was not reassured.\nI remembered the fox.\n",
    "One runs the risk of weeping a little, if one lets \nhimself be tamed… \nBeside the well there was the ruin of an old stone wall.\n",
    "When I came back from my work, the next \nevening, I saw from some distance away my little prince sitting on top of a wall, with his feet \n",
    "dangling.\nAnd I heard him say: “Then you don’t remember.\nThis is not the exact spot.” Another \nvoice must have answered him, for he replied to it: “Yes, yes!\n",
    "It is the right day, but this is not the \nplace.” \nI continued my walk toward the wall.\nAt no time did I see or hear anyone.\n",
    "The little prince, \nhowever, replied once again: “…Exactly.\nYou will see where my track begins, in the sand.\n",
    "You have \nnothing to do but wait for me there.\nI shall be there tonight.” \n\nI was only twenty metres from the wall, and I still saw nothing.\n",
    "After a silence the little prince \nspoke again: “You have good poison?\nYou are sure that it will not make me suffer too long?” I \n",
    "stopped in my tracks, my heart torn asunder; but still I did not understand.\n“Now go away,” said \nthe little prince.\n",
    "“I want to get down from the wall.” \nI dropped my eyes, then, to the foot of the wall… and I leaped into the air.\n",
    "There before me, facing \nthe little prince, was one of those yellow snakes that take just thirty seconds to bring your life to \n",
    "an end.\nEven as I was digging into my pocked to get out my revolver I made a running step back.\nBut, at the noise I made, the snake let himself flow easily across the sand like the dying spray of \n",
    "a fountain, and, in no apparent hurry, disappeared, with a light metallic sound, among the stones.\nI \n",
    "reached the wall just in time to catch my little man in my arms; his face was white as snow.\n\n“What does this mean?” I demanded.\n",
    "“Why are you talking with snakes?” \nI had loosened the golden muffler that he always wore.\nI had moistened his temples, and had \n",
    "given him some water to drink.\nAnd now I did not dare ask him any more questions.\nHe looked at \nme very gravely, and put his arms around my neck.\n",
    "I felt his heart beating like the heart of a \ndying bird, shot with someone’s rifle… \n“I am glad that you have found what was the matter with your engine,” he said.\n",
    "“Now you can go \nback home” \n“How do you know about that?” I was just coming to tell him that my work had been successful, \n",
    "beyond anything that I had dared to hope.\n\nHe made no answer to my question, but he added: “I, too, am going back home today…” Then, \n",
    "sadly, “It is much farther… it is much more difficult…” I realised clearly that something \nextraordinary was happening.\n",
    "I was holding him close in my arms as if he were a little child; and \nyet it seemed to me that he was rushing headlong toward an abyss from which I could do nothing \n",
    "to restrain him… His look was very serious, like some one lost far away.\n\n“I have your sheep.\nAnd I have the sheep’s box.\n",
    "And I have the muzzle…” \nAnd he gave me a sad smile.\nI waited a long time.\nI could see that he was reviving little by little.\n",
    "\n“Dear little man,” I said to him, “you are afraid…” He was afraid, there was no doubt about that.\nBut he laughed lightly.\n",
    "\n“I shall be much more afraid this evening…” \nOnce again I felt myself frozen by the sense of something irreparable.\n",
    "And I knew that I could not \nbear the thought of never hearing that laughter any more.\nFor me, it was like a spring of fresh \n",
    "water in the desert.\n\n“Little man,” I said, “I want to hear you laugh again.” But he said to me: “Tonight, it will be a \n",
    "year… my star, then, can be found right above the place where I came to the Earth, a year ago…” \n",
    "“Little man,” I said, “tell me that it is only a bad dream, this affair of the snake, and the meeting- \n",
    "place, and the star…” But he did not answer my plea.\n\nHe said to me, instead: “The thing that is important is the thing that is not seen…” “Yes, I \n",
    "know…” \n\n\n“It is just as it is with the flower.\nIf you love a flower that lives on a star, it is sweet to look at the \n",
    "sky at night.\nAll the stars are a-bloom with flowers…” \n“Yes, I know…” \n“It is just as it is with the water.\n",
    "Because of the pulley, and the rope, what you gave me to drink \nwas like music.\nYou remember, how good it was.” \n",
    "“Yes, I know…” \n“And at night you will look up at the stars.\nWhere I live everything is so small that I cannot show \n",
    "you where my star is to be found.\nIt is better, like that.\nMy star will just be one of the stars, for \n",
    "you.\nAnd so you will love to watch all the stars in the heavens… they will all be your friends.\nAnd, \n",
    "besides, I am going to make you a present…” He laughed again.\n\n“Ah, little prince, dear little prince!\n",
    "I love to hear that laughter!” \n“That is my present.\nJust that.\nIt will be as it was when we drank the water…” \n",
    "“What are you trying to say?” \n“All men have the stars,” he answered, “but they are not the same things for different people.\n",
    "For \nsome, who are travellers, the stars are guides.\nFor others they are no more than little lights in the \n",
    "sky.\nFor others, who are scholars, they are problems.\nFor my businessman they were wealth.\nBut \nall these stars are silent.\n",
    "You, you alone, will have the stars as no one else has them” \n“What are you trying to say?” \n“In one of the stars I shall be living.\n",
    "In one of them I shall be laughing.\nAnd so it will be as if all \nthe stars were laughing, when you look at the sky at night… you, only you, will have stars that can \n",
    "laugh!” \nAnd he laughed again.\n“And when your sorrow is comforted (time soothes all sorrows) you will be \n",
    "content that you have known me.\nYou will always be my friend.\nYou will want to laugh with me.\nAnd \nyou will sometimes open your window, so, for that pleasure… and your friends will be properly \n",
    "astonished to see you laughing as you look up at the sky!\nThen you will say to them, ‘Yes, the \nstars always make me laugh!’ And they will think you are crazy.\n",
    "It will be a very shabby trick that \nI shall have played on you…” \nAnd he laughed again.\n“It will be as if, in place of the stars, I had given you a great number of \n",
    "little bells that knew how to laugh…” \nAnd he laughed again.\nThen he quickly became serious: “Tonight, you know… do not come,” said \n",
    "the little prince.\n\n“I shall not leave you,” I said.\n\n“I shall look as if I were suffering.\nI shall look a little as if I were dying.\n",
    "It is like that.\nDo not \ncome to see that.\nIt is not worth the trouble…” \n“I shall not leave you.” \n",
    "\nBut he was worried.\n“I tell you, it is also because of the snake.\nHe must not bite you.\nSnakes, they \n",
    "\n\nare malicious creatures.\nThis one might bite you just for fun…” \n\n“I shall not leave you.” \nBut a thought came to reassure him: “It is true that they have no more poison for a second bite.” \n",
    "That night I did not see him set out on his way.\nHe got away from me without making a sound.\nWhen I succeeded in catching up with him he was walking along with a quick and resolute step.\n",
    "He \nsaid to me merely: “Ah!\nYou are there…” And he took me by the hand.\nBut he was still worrying.\n“It was wrong of you to come.\n",
    "You will suffer.\nI shall look as if I were dead; and that will not be \ntrue…” \nI said nothing.\n\n“You understand… it is too far.\n",
    "I cannot carry this body with me.\nIt is too heavy.” \nI said nothing.\n\n“But it will be like an old abandoned shell.\n",
    "There is nothing sad about old shells…” \nI said nothing.\nHe was a little discouraged.\nBut he made one more effort: “You know, it will be \n",
    "very nice.\nI, too, shall look at the stars.\nAll the stars will be wells with a rusty pulley.\nAll the stars \n",
    "will pour out fresh water for me to drink…” \nI said nothing.\n\n“That will be so amusing!\nYou will have five hundred million little bells, and I shall have five \n",
    "hundred million springs of fresh water…” And he too said nothing more, because he was crying… \n“Here it is.\n",
    "Let me go on by myself.” And he sat down, because he was afraid.\nThen he said, \nagain: “You know, my flower… I am responsible for her.\n",
    "And she is so weak!\nShe has four thorns, \nof no use at all, to protect herself against all the world…” \n",
    "I too sat down, because I was not able to stand up any longer.\n“There now, that is all…” \nHe still hesitated a little; then he got up.\n",
    "He took one step.\nI could not move.\nThere was nothing \nbut a flash of yellow close to his ankle.\nHe remained motionless for an instant.\n",
    "He did not cry out.\nHe fell as gently as a tree falls.\nThere was not even any sound, because of the sand.\n",
    "\nAnd now six years have already gone by… I have never yet told this story.\n\nThe companions who met me on my return were well content to see me alive.\n",
    "I was sad, but I told \nthem: “I am tired.” Now my sorrow is comforted a little.\nThat is to say, not entirely.\n",
    "But I know \nthat he did go back to his planet, because I did not find his body at daybreak.\nIt was not such a \n",
    "heavy body… and at night I love to listen to the stars.\nIt is like five hundred million little bells… \n",
    "But there is one extraordinary thing… when I drew the muzzle for the little prince, I forgot to add \n",
    "the leather strap to it.\nHe will never have been able to fasten it on his sheep.\n\nSo now I keep wondering: what is happening on his planet?\n",
    "Perhaps the sheep has eaten the \nflower… At one time I say to myself: “Surely not!\nThe little prince shuts his flower under her glass \n",
    "globe every night, and he watches over his sheep very carefully…” Then I am happy.\nAnd there is \nsweetness in the laughter of all the stars.\n",
    "\n\nBut at another time I say to myself: “At some moment or other one is absent-minded, and that is \nenough!\n",
    "On some one evening he forgot the glass globe, or the sheep got out, without making any \nnoise, in the night…” And then the little bells are changed to tears… Here, then, is a great \n",
    "mystery.\n\nFor you who also love the little prince, and for me, nothing in the universe can be the same if \n",
    "somewhere, we do not know where, a sheep that we never saw has eaten a rose… Look up at the \nsky.\nAsk yourselves: is it yes or no?\n",
    "\nHas the sheep eaten the flower?\nAnd you will see how everything changes… And no grown-up will \never understand that this is a matter of so much importance!\n",
    "This is, to me, the loveliest and \nsaddest landscape in the world.\nIt is the same as that on the preceding page, but I have drawn it \n",
    "again to impress it on your memory.\nIt is here that the little prince appeared on Earth, and \ndisappeared.\n",
    "Look at it carefully so that you will be sure to recognise it in case you travel some \nday to the African desert.\n",
    "And, if you should come upon this spot, please do not hurry on.\nWait for \na time, exactly under the star.\n",
    "Then, if a little man appears who laughs, who has golden hair and \nwho refuses to answer questions, you will know who he is.\n",
    "If this should happen, please comfort \nme.\nSend me word that he has come back.\n\n"
]