[
    "Als ich sechs war, sah ich einmal ein wunderbares Bild in einem Buch über den Dschungel, das \"Wahre Geschichten\" hieß.",
    "Auf dem Bild war eine Königsschlange, die gerade ein wildes Tier verschlingen wollte.",
    "Der kleine Prinz – Eine Boa, die ein wildes Tier verschlingt In diesem Buch heißt es: \"Boas verschlingen ihre Beute als Ganzes, ohne zu kauen.",
    "Danach können sie sich nicht mehr bewegen und schlafen sechs Monate zur Verdauung.\"  Ich grübelte daher viel über die Ereignisse im Dschungel.",
    "Mit einem Farbstift gelang mir meine erste Zeichnung.",
    "Meine Zeichnung Nummero 1.",
    "Sie sah so aus:  Der kleine Prinz – Die geschlossene Riesenschlange Ich legte mein Meisterwerk den großen Leuten vor und fragte sie, ob ihnen die Zeichnung nicht Angst mache.",
    "Sie sagten: \"Warum sollten wir Angst vor einem Hut bekommen?\"  Meine Zeichnung stellte aber gar keinen Hut dar.",
    "Es war eine Riesenschlange, die einen Elefanten verdaut.",
    "Ich zeichnete also das Innere der Boa, damit es die großen Leute genau erkannten, denn sie brauchen immer Erklärungen.",
    "Meine Zeichnung Nummero 2 sah so aus:   Ich musste mir also einen anderen Beruf wählen, und ich lernte Flugzeuge zu fliegen.",
    "Ich flog durch die ganze Welt.",
    "Die Geographie, das ist richtig, hat mir gute Dienste dabei geleistet.",
    "Auf den ersten Blick kann ich nun China von Arizona unterscheiden.",
    "Das ist besonders hilfreich, wenn man sich in der Nacht verirrt hat.",
    "In meinem Leben lernte ich viele bedeutende Menschen kennen.",
    "Ich lebte mit ihnen zusammen und beobachtete sie ganz genau.",
    "Doch an meiner Meinung über sie änderte sich nichts.",
    "Immer, wenn ich jemanden traf, der mir ein wenig schlauer vorkam, zeigte ich meine Zeichnung Nummero 1, die ich mir dafür aufgehoben hatte.",
    "Ich wollte wissen, ob er sie verstand.",
    "Aber alle antworteten sie nur: \"Dies ist ein Hut.\" Dann wusste ich, dass ich mit diesen Leuten nicht über Boas oder den Dschungel reden konnte.",
    "Also stellte ich mich auf sie ein.",
    "Mit ihnen sprach ich über Kartenspiele, Golf, Politik und Krawatten.",
    "Die großen Leute waren dann immer froh, einen vernünftigen Mann kennengelernt zu haben."
]