[
    "Nennt mich Ishmael.",
    "Vor einigen Jahren - ich weiß nicht, wie lange genau - hatte ich wenig oder gar kein Geld in der Tasche und nichts Besonderes, was mich an Land interessierte, und so dachte ich, ich würde ein wenig herumsegeln und den wässrigen Teil der Welt sehen.",
    "Auf diese Weise kann ich die Milz vertreiben und den Kreislauf regulieren.",
    "Immer, wenn ich merke, dass ich grimmig werde, wenn ich einen feuchten, nieseligen November in der Seele habe, wenn ich unwillkürlich vor Sarglagern innehalte und bei jeder Beerdigung, die ich treffe, die Nachhut bilde, und vor allem, wenn meine Hypos so sehr die Oberhand über mich gewinnen, dass es eines starken moralischen Prinzips bedarf, um mich davon abzuhalten, absichtlich auf die Straße zu treten und den Leuten methodisch die Hüte vom Kopf zu schlagen - dann halte ich es für höchste Zeit, so schnell wie möglich zur See zu fahren.",
    "Dies ist mein Ersatz für Pistole und Kugel.",
    "Mit einem philosophischen Schwung wirft sich Cato auf sein Schwert; ich begebe mich leise auf das Schiff.",
    "Daran ist nichts Überraschendes.",
    "Wenn sie es nur wüssten, fast alle Männer ihres Standes hegen zu irgendeinem Zeitpunkt fast dieselben Gefühle gegenüber dem Meer wie ich.",
    "Da ist nun Ihre Inselstadt der Manhattoes, die von Kais umgeben ist wie indische Inseln von Korallenriffen - der Handel umgibt sie mit seiner Brandung.",
    "Rechts und links führen die Straßen zum Wasser hin.",
    "Das äußerste Stadtzentrum ist die Batterie, wo die edle Mole von den Wellen umspült und von Brisen gekühlt wird, die wenige Stunden zuvor noch außerhalb der Sichtweite des Landes waren.",
    "Schauen Sie sich dort die Scharen von Wasserguckern an.",
    "Umrunden Sie die Stadt an einem verträumten Sabbatnachmittag.",
    "Gehen Sie von Corlears Hook zur Coenties Slip und von dort über Whitehall nach Norden.",
    "Was siehst du?",
    "- Wie schweigende Wächter stehen überall in der Stadt Tausende und Abertausende von sterblichen Menschen, die in die Träume des Meeres versunken sind.",
    "Einige lehnen an den Pfählen, andere sitzen auf den Molen, einige schauen über die Schanzkleidungen der Schiffe aus China, andere hoch oben in der Takelage, als wollten sie einen noch besseren Blick auf das Meer erhaschen.",
    "Aber das sind alles Landbewohner, die wochentags in Latten und Gips gefangen sind - an Theken gefesselt, an Bänke genagelt, an Schreibtische geklammert.",
    "Wie ist das denn?",
    "Sind die grünen Felder weg?",
    "Was tun sie hier?",
    "Aber sieh nur, da kommen noch mehr Menschen, die geradewegs auf das Wasser zugehen und sich scheinbar in die Fluten stürzen wollen.",
    "Seltsam!",
    "Nichts wird sie zufriedenstellen als die äußerste Grenze des Landes; es genügt nicht, sich im schattigen Windschatten der Lagerhäuser dort drüben aufzuhalten.",
    "Nein, sie müssen sich dem Wasser so weit wie möglich nähern, ohne hineinzufallen.",
    "Und da stehen sie - Meilen von ihnen - Meilen.",
    "Sie kommen alle aus dem Inland, aus Gassen, Straßen und Alleen - aus dem Norden, Osten, Süden und Westen.",
    "Doch hier sind sie alle vereint.",
    "Sagt mir, zieht die magnetische Kraft der Kompassnadeln all dieser Schiffe sie dorthin?",
    "Noch einmal.",

    
    "Stell dir vor, du bist auf dem Land, in einem Hochland mit Seen.",
    "Nehmt fast jeden Weg, den ihr wollt, und zehn zu eins führt er euch hinunter in eine Senke und lässt euch dort an einem Tümpel im Bach zurück.",
    "Es liegt ein Zauber darin.",
    "Lass den geistesabwesendsten Menschen in seine tiefsten Träumereien versinken - stell ihn auf die Beine, setze seine Füße in Bewegung, und er wird dich unfehlbar zum Wasser führen, wenn es in dieser ganzen Gegend Wasser gibt.",
    "Sollten Sie jemals in der großen amerikanischen Wüste durstig sein, versuchen Sie dieses Experiment, wenn Ihre Karawane zufällig mit einem metaphysischen Professor ausgestattet ist.",
    "Ja, wie jeder weiß, sind Meditation und Wasser für immer miteinander verbunden.",
    "Aber hier ist ein Künstler.",
    "Er möchte Ihnen das verträumteste, schattigste, stillste und bezauberndste Stück romantischer Landschaft im ganzen Tal des Saco malen.",
    "Was ist das wichtigste Element, das er verwendet?",
    "Da stehen seine Bäume, jeder mit einem hohlen Stamm, als ob ein Einsiedler und ein Kruzifix darin wären; und hier schläft seine Wiese, und dort schläft sein Vieh; und von der Hütte dort steigt ein schläfriger Rauch auf.",
    "Tief in die fernen Wälder windet sich ein verworrener Weg, der bis zu den überlappenden Ausläufern der Berge reicht, die in ihrem Bergblau gebadet sind.",
    "Doch obwohl das Bild so ruhig daliegt, und obwohl diese Kiefer ihre Seufzer wie Blätter auf das Haupt dieses Hirten herabschüttelt, wäre doch alles vergebens, wenn nicht das Auge des Hirten auf den magischen Strom vor ihm gerichtet wäre.",
    "Besuchen Sie die Prärien im Juni, wenn Sie Dutzende von Kilometern knietief zwischen Tigerlilien waten - was ist der einzige Zauber, der fehlt?- Wasser - es gibt dort keinen Tropfen Wasser!",
    "Wäre der Niagara nur ein Katarakt aus Sand, würdest du tausend Meilen reisen, um ihn zu sehen?",
    "Warum überlegte der arme Dichter aus Tennessee, als er plötzlich zwei Handvoll Silber erhielt, ob er sich einen Mantel kaufen sollte, den er dringend benötigte, oder ob er sein Geld in eine Fußgängerreise nach Rockaway Beach investieren sollte?",
    "Warum ist fast jeder robuste, gesunde Junge mit einer robusten, gesunden Seele in sich irgendwann einmal verrückt danach, zur See zu fahren?",
    "Warum haben Sie auf Ihrer ersten Reise als Passagier selbst eine so mystische Schwingung gespürt, als Ihnen zum ersten Mal gesagt wurde, dass Sie und Ihr Schiff nun außer Sichtweite des Landes sind?",
    "Warum hielten die alten Perser das Meer für heilig?",
    "Warum gaben die Griechen ihm eine eigene Gottheit und einen eigenen Bruder des Jupiter?",
    "Sicherlich ist all dies nicht ohne Bedeutung.",
    "Und noch tiefer ist der Sinn jener Geschichte von Narziss, der, weil er das quälende, milde Bild, das er in der Quelle sah, nicht fassen konnte, sich in sie stürzte und ertrank.",
    "Aber das gleiche Bild sehen wir selbst in allen Flüssen und Meeren.",
    "Es ist das Bild des unfassbaren Phantoms des Lebens; und das ist der Schlüssel zu allem.",
    "Wenn ich nun sage, dass ich die Angewohnheit habe, immer dann zur See zu fahren, wenn mir die Augen trübe werden und ich mich meiner Lungen nicht mehr bewusst bin, so will ich damit nicht sagen, dass ich jemals als Passagier zur See fahre.",
    "Denn um als Passagier zu fahren, braucht man eine Handtasche, und eine Handtasche ist nur ein Lappen, wenn man nichts darin hat.",
    "Außerdem werden die Passagiere seekrank, zanken sich, schlafen nachts nicht und haben im Allgemeinen nicht viel Spaß; nein, ich fahre nie als Passagier, und obwohl ich etwas von einem Salz bin, fahre ich nie als Kommodore, Kapitän oder Koch zur See.",
    "Ich überlasse den Ruhm und die Auszeichnung solcher Ämter denen, die sie mögen.",
    "Ich für meinen Teil verabscheue alle ehrenhaften, respektablen Mühen, Prüfungen und Strapazen jeglicher Art.",
    "Ich kann nur für mich selbst sorgen, ohne mich um Schiffe, Barken, Briggs, Schoner und dergleichen zu kümmern.",
    "Und was den Beruf des Kochs angeht, so gestehe ich, dass er mit beträchtlichem Ruhm verbunden ist, denn ein Koch ist eine Art Offizier an Bord eines Schiffes, aber irgendwie hatte ich nie Lust, Hühner zu braten, obwohl, wenn sie einmal gebraten, mit Butter bestrichen und mit Salz und Pfeffer gewürzt sind, es niemanden gibt, der respektvoller, um nicht zu sagen ehrfürchtiger, von einem gebratenen Huhn spricht als ich.",
    "Die Mumien der alten Ägypter, die man in ihren riesigen Backhäusern, den Pyramiden, sieht, stammen von den götzendienerischen Anwandlungen der alten Ägypter an gebratenen Ibissen und gebratenen Flusspferden.",
    "Nein, wenn ich zur See fahre, fahre ich wie ein einfacher Seemann, direkt vor dem Mast, lotrecht hinunter ins Vorschiff, dort hoch zum königlichen Mastkopf.",
    "Zugegeben, sie kommandieren mich ziemlich herum und lassen mich von Spiere zu Spiere hüpfen, wie ein Grashüpfer auf einer Maiwiese.",
    "Und am Anfang ist so etwas unangenehm genug.",
    "Es rührt an das Ehrgefühl, vor allem, wenn man aus einer alteingesessenen Familie stammt, den Van Rensselaers, den Randolphs oder den Hardicanutes.",
    "Und vor allem, wenn man, kurz bevor man die Hand in den Teertopf steckte, als Schulmeister auf dem Lande geherrscht hat, so dass die größten Jungen in Ehrfurcht vor einem standen.",
    "Ich versichere Ihnen, dass der Übergang vom Schulmeister zum Matrosen ein harter ist und eine starke Brühe von Seneca und den Stoikern erfordert, damit Sie ihn lächelnd ertragen können.",
    "Aber auch das lässt mit der Zeit nach.",
    "Was ist schon dabei, wenn mir ein alter Knacker von einem Kapitän befiehlt, einen Besen zu holen und die Decks zu fegen?",
    "Was bedeutet diese Demütigung, wenn man sie mit den Maßstäben des Neuen Testaments vergleicht?",
    "Glauben Sie, dass der Erzengel Gabriel weniger von mir hält, weil ich diesem alten Kerl in diesem speziellen Fall pünktlich und respektvoll gehorche?",
    "Wer ist kein Sklave?",
    "Sag mir das.",
    "Nun, wie auch immer die alten Kapitäne mich herumkommandieren mögen, wie auch immer sie mich schlagen und prügeln mögen, ich habe die Genugtuung zu wissen, dass es in Ordnung ist; dass jeder andere auf die eine oder andere Weise auf die gleiche Weise bedient wird - entweder in physischer oder metaphysischer Hinsicht, das heißt; und so wird der universelle Schlag herumgereicht, und alle Hände sollten sich gegenseitig die Schulterblätter reiben und zufrieden sein.",
    "Auch ich fahre immer als Seemann zur See, weil sie mich für meine Mühe bezahlen, während sie den Passagieren keinen einzigen Pfennig zahlen, von dem ich je gehört habe.",
    "Im Gegenteil, die Passagiere müssen selbst zahlen.",
    "Und es gibt einen großen Unterschied zwischen dem Bezahlen und dem Bezahlt-Werden.",
    "Der Akt des Bezahlens ist vielleicht das Unangenehmste, was uns die beiden Obstdiebe angetan haben.",
    "Aber bezahlt zu werden, was kann man damit vergleichen?",
    "Die urbane Aktivität, mit der ein Mensch Geld empfängt, ist wirklich erstaunlich, wenn man bedenkt, dass wir so ernsthaft glauben, dass Geld die Wurzel aller irdischen Übel ist, und dass ein begüterter Mensch auf keinen Fall in den Himmel kommen kann.",
    "Ach!",
    "wie fröhlich wir uns dem Verderben überlassen!",
    "Schließlich fahre ich immer als Seemann zur See, wegen der heilsamen Bewegung und der reinen Luft auf dem Deck des Vorschiffs.",
    "Denn so wie in dieser Welt die Gegenwinde weitaus häufiger sind als die Winde von achtern (das heißt, wenn man nie gegen den Satz des Pythagoras verstößt), so erhält der Kommodore auf dem Achterdeck seine Atmosphäre zumeist aus zweiter Hand von den Matrosen auf dem Vorschiff.",
    "Er denkt, er atmet sie zuerst ein, aber das stimmt nicht.",
    "Auf die gleiche Weise führen die Bürgerlichen ihre Anführer in vielen anderen Dingen, ohne dass diese es bemerken.",
    "Aber warum ich, nachdem ich wiederholt als Handelsmatrose das Meer gerochen hatte, mir nun in den Kopf setzte, auf Walfang zu gehen, das kann der unsichtbare Polizist des Schicksals, der mich ständig überwacht, mich heimlich verfolgt und auf irgendeine unerklärliche Weise beeinflusst, besser beantworten als irgendjemand sonst.",
    "Und zweifellos war meine Reise auf den Walfang Teil des großen Programms der Vorsehung, das vor langer Zeit aufgestellt wurde.",
    "Sie war eine Art kurzes Zwischenspiel und Solo zwischen umfangreicheren Auftritten.",
    "Ich nehme an, dass dieser Teil des Programms in etwa so gelaufen sein muss:  \"Grand Contested Election for the Presidency of the United States.",
    "\"WALFANGREISE VON EINEM ISHMAEL.",
    "\"BLUTIGE SCHLACHT IN AFGHANISTAN\".",
    "Ich kann zwar nicht genau sagen, warum die Bühnenleiter, das Schicksal, mich für diese schäbige Rolle einer Walfangfahrt vorgesehen haben, während andere für prächtige Rollen in hohen Tragödien, kurze und leichte Rollen in vornehmeren Komödien und lustige Rollen in Farcen vorgesehen waren - ich kann zwar nicht genau sagen, warum das so war; Doch jetzt, da ich mich an alle Umstände erinnere, glaube ich, ein wenig die Quellen und Motive zu erkennen, die mir unter verschiedenen Verkleidungen listig vorgeführt wurden und mich dazu brachten, die Rolle zu spielen, die ich spielte, und mir außerdem vorgaukelten, dass es sich um eine Wahl handelte, die aus meinem eigenen unvoreingenommenen freien Willen und meinem differenzierten Urteil resultierte.",
    "Das wichtigste dieser Motive war die überwältigende Vorstellung des großen Wals selbst.",
    "Ein solch unheilvolles und geheimnisvolles Ungeheuer weckte meine ganze Neugierde.",
    "Die wilden und fernen Meere, in denen er sich mit seiner Inselmasse wälzte, die unerreichbaren, namenlosen Gefahren des Wals - all das, mit all den dazugehörigen Wundern von tausend patagonischen Sehenswürdigkeiten und Geräuschen, trug dazu bei, mich zu meinem Wunsch zu bewegen.",
    "Bei anderen Menschen wären solche Dinge vielleicht keine Anreize gewesen, aber was mich betrifft, so quält mich ein immerwährendes Verlangen nach fernen Dingen.",
    "Ich liebe es, auf verbotenen Meeren zu segeln und an barbarischen Küsten zu landen.",
    "Da ich das Gute nicht verkenne, erkenne ich schnell das Grauen und könnte trotzdem mit ihm verkehren - wenn man mich ließe -, denn es ist gut, mit allen Bewohnern des Ortes, in dem man wohnt, freundlich zu sein.",
    "So war denn die Walfahrt willkommen; die großen Schleusen der Wunderwelt öffneten sich, und in den wilden Einbildungen, die mich zu meinem Vorhaben bewegten, schwebten zwei und zwei in mein Innerstes, endlose Walzüge, und in der Mitte von ihnen allen ein großes Kapuzengespenst, wie ein Schneeberg in der Luft.",
    ""
]